package com.dubboclub.dk.remote.common;
/**
 * 错误码
 * @author liumintao
 *
 */
public enum ErrCode implements CodeDesc {
	/**
	 * 错误码生成规范：
	 * 错误码由7位组成：
	 * 第一位：	S	系统级错误
     *      	D	数据库级错误
     *			I	平台级错误
     *			P	产品级错误(基础模块 de ln fn cif，公共方法级)
     *			A	应用级错误（门户、微信等）
     * 第二位：	B	互金平台base	仅当S D I P打头使用。
     *			D	存款       		仅当P打头使用。
     *			L	贷款产品层		仅当P打头使用。
     *			F	理财			仅当P打头使用。
     *			C	客户模块		仅当P打头使用。
     *			R	远程调用		仅当P打头使用。
     *			G	网关			仅当A打头使用。
     *			P	门户网站		仅当A打头使用。
     *			W	微信银行		仅当A打头使用。
     *			M	移动银行		仅当A打头使用。
     *			E	网银			仅当A打头使用。
     *			O	三方接入		仅当A打头使用。
     * 后三位： 三位顺序码 保证不重复即可
	 * */
	//电子回单 错误码
	PO001("PO001", "回单验证失败"),
	PO002("PO002", "电子回单查询失败"),
	
	//互金发起remote远程调用错误码
	PR001("PR001", "ERS远程调用失败"),
	
	//互金平台base公共业务方法错误码
	PB001("PB001", "交易流水不存在"),
	PB002("PB002", "仅支持24小时内交易撤销"),
	PB003("PB003", "流水不能为空"),
	PB004("PB004", "公私钥信息获取失败"),
	PB005("PB005", "合作方参数信息查询失败"),
	
	//存款模块公共业务方法错误码
	PD005("PD005", "余额信息不存在"),
	
	//第三方接入应用级错误码
	AO001("AO001", "证件已过期"),
	AO002("AO002", "手机号码格式错误"),
	AO003("AO003", "姓名格式错误"),
	AO004("AO004", "身份证号码格式错误"),
	AO005("AO005", "性别与证件不符"),
	AO006("AO006", "联行行号获取失败"),
	AO007("AO007", "获取网点名称失败"),
	AO008("AO008", "统一信用代码证格式错误"),
	AO009("AO009", "证件类型错误"),
	AO010("AO010", "证件类型转换失败"),
	AO011("AO011", "传入账号不能为空"),
	AO012("AO012", "资金控制种类不能为空"),
	AO013("AO013", "资金控制方式不能为空"),
	AO014("AO014", "资金控制类型不能为空"),
	AO015("AO015", "金额不能为零"),
	AO016("AO016", "自动解除标志不能为空"),
	AO017("AO017", "自动解除日期不能为空"),
	AO018("AO018", "法律文书不能为空"),
	AO019("AO019", "冻结序号不能为空"),
	AL001("AL001", "借据号不能为空"),
	AL002("AL002", "还款模式不能为空"),
	AL003("AL003", "还款来源不能为空"),
	AL004("AL004", "提前还款失败"),
	
	//移动银行app应用错误码
	AM001("AM001", "产品编号不能为空"),
	AM002("AM002", "证件类型不能为空"),
	AM003("AM003", "产品号码不能为空"),
	AM004("AM004", "账户名称不能为空"),
	AM005("AM005", "存款周期不能为空"),
	AM006("AM006", "存款周期类型不能为空"),
	AM007("AM007", "金额不能为零"),
	AM008("AM008", "定期到期自动转存标志不能为空"),
	AM009("AM009", "定期支取方式不能为空"),
	AM010("AM010", "支取密码不能为空"),
	AM011("AM011", "账号不能为空"),
	AM012("AM012", "自动转存方式错误"),
	AM013("AM013", "调用核心开户失败"),
	AM014("AM014", "定期账户支取失败"),
	AM015("AM015", "操作方式不能为空"),
	AM016("AM016", "起始日期不能为空"),
	AM017("AM017", "支取日期不能为空"),
	AM018("AM018", "产品类型不符"),
	AM019("AM019", "尚未建立客户信息"),
	AM020("AM020", "付款账户不存在"),
	AM021("AM021", "获取核心客户信息失败"),
	AM022("AM022", "不支持的证件类型"),
	AM023("AM023", "转开定期账户失败"),
	AM024("AM024", "注册证件号与核心证件号不符"),
	AM025("AM025", "账户类型不符"),
	AM026("AM026", "调用第三方接口返回失败"),
	AM027("AM027", "金额超限"),
	AM028("AM028", "金额不足"),
	AM029("AM029", "未查到该客户号的相关信息"),
	AM030("AM030", "该账户尚未添加到手机APP"),
	AM031("AM031", "签约失败"),
	AM032("AM032", "该账户已签约会存"),
	AM033("AM033", "解约失败"),
	AM034("AM034", "该账户未签约会存"),
	AM035("AM035", "会存提前支取失败"),
	AM036("AM036", "账号不符"),
	AM037("AM037", "已申请解约"),
	AM038("AM038", "签约状态异常"),
	AM039("AM039", "信息查询失败"),
	AM040("AM040", "该帐户已签约就享存"),
	AM041("AM041", "卡类型不符"),
	
	
	AM999("AM999", "交易失败"),

  /*
   * AC001("AC001", "产生账号序列号错误")
   */
  AC001("AC001", "产生账号序列号错误"),
  /*
   *  PC001("PC001","调用公共方法失败"),
   */
  PC001("PC001","调用公共方法失败"),
  /*
   *  PC002("PC002","调用公共方法失败"),
   */
  PC002("PC002","调用公共方法插入数据失败"),

  /*
   * AC002("AC002", "账号类型错误")
   */
  AC002("AC002", "账号类型错误"),

  /*
   * AC003("AC003", "你已在本行开过户,请登录")
   */
  AC003("AC003", "你已在本行开过户,请登录"),

  /*
   * AC004("AC004", "账户序号添加失败")
   */
  AC004("AC004", "账户序号添加失败"),

  /*
   * AC005("AC005", "卡对账信息获取失败")
   */
  AC005("AC005", "卡对账信息获取失败"),

  /*
   * AC006("AC006", "卡对账日期为空")
   */
  AC006("AC006", "卡对账日期为空"),

  /*
   * AC007("AC007", "该账户已销户")
   */
  AC007("AC007", "该账户已销户"),

  /*
   * AC008("AC008", "账户不存在")
   */
  AC008("AC008", "账户不存在"),

  /*
   * AC009("AC009", "电子账户绑定卡激活失败")
   */
  AC009("AC009", "电子账户绑定卡激活失败"),

  /*
   * AC010("AC010", "该账户与卡已绑定")
   */
  AC010("AC010", "该账户与卡已绑定"),

  /*
   * AC011("AC011", "测试20170315")
   */
  AC011("AC011", "测试20170315"),

  /*
   * AC012("AC012", "电子账户户名与绑定卡户名不匹配")
   */
  AC012("AC012", "电子账户户名与绑定卡户名不匹配"),

  /*
   * AC013("AC013", "电子账户证件信息与绑卡证件信息不匹配")
   */
  AC013("AC013", "电子账户证件信息与绑卡证件信息不匹配"),

  /*
   * AC014("AC014", "密码已设置")
   */
  AC014("AC014", "密码已设置"),

  /*
   * AC015("AC015", "该账户与卡已解绑")
   */
  AC015("AC015", "该账户与卡已解绑"),

  /*
   * AC016("AC016", "该账户下存在理财产品，不可销户")
   */
  AC016("AC016", "该账户下存在理财产品，不可销户"),

  /*
   * AC017("AC017", "账户名称错误")
   */
  AC017("AC017", "账户名称错误"),

  /*
   * AC018("AC018", "查询账户信息不存在")
   */
  AC018("AC018", "查询账户信息不存在"),

  /*
   * AC019("AC019", "签约账号不存在")
   */
  AC019("AC019", "签约账号不存在"),

  /*
   * AC020("AC020", "存在该电子账户，开户机构不一致")
   */
  AC020("AC020", "存在该电子账户，开户机构不一致"),

  /*
   * AC021("AC021", "账户姓名不匹配")
   */
  AC021("AC021", "账户姓名不匹配"),

  /*
   * AC022("AC022", "该账户未绑定手机号")
   */
  AC022("AC022", "该账户未绑定手机号"),

  /*
   * AC023("AC023", "手机号不匹配")
   */
  AC023("AC023", "手机号不匹配"),

  /*
   * AC024("AC024", "该账户介质已销户")
   */
  AC024("AC024", "该账户介质已销户"),

  /*
   * AC025("AC025", "该账户已销户")
   */
  AC025("AC025", "该账户已销户"),

  /*
   * AC026("AC026", "该账户被冻结，请先解冻")
   */
  AC026("AC026", "登录密码已被冻结，请通过“忘记密码”重置后再登录"),

  /*
   * AC027("AC027", "该账户被止付，请先解止付")
   */
  AC027("AC027", "该账户被止付，请先解止付"),

  /*
   */
  AC028("AC028", "该账户下存在随心存产品未销户"),

  /*
   * AC029("AC029", "该账户下存在随心存产品被冻结")
   */
  AC029("AC029", "该账户下存在随心存产品被冻结"),

  /*
   * AC030("AC030", "该账户下存在随心存产品被止付")
   */
  AC030("AC030", "该账户下存在随心存产品被止付"),

  /*
   * AC031("AC031", "该账户下存在幸福存产品未销户")
   */
  AC031("AC031", "该账户下存在幸福存产品未销户"),

  /*
   * AC032("AC032", "该账户下存在幸福存产品被冻结")
   */
  AC032("AC032", "该账户下存在幸福存产品被冻结"),

  /*
   * AC033("AC033", "该账户下存在幸福存产品被止付")
   */
  AC033("AC033", "该账户下存在幸福存产品被止付"),

  /*
   * AC034("AC034", "该账户下存在智能通知存款未销户")
   */
  AC034("AC034", "该账户下存在智能通知存款未销户"),

  /*
   * AC035("AC035", "该账户下存在智能通知存款被冻结")
   */
  AC035("AC035", "该账户下存在智能通知存款被冻结"),

  /*
   * AC036("AC036", "该账户下存在智能通知存款被止付")
   */
  AC036("AC036", "该账户下存在智能通知存款被止付"),

  /*
   * AC037("AC037", "该账户下存在大额存单未销户")
   */
  AC037("AC037", "该账户下存在大额存单未销户"),

  /*
   * AC038("AC038", "该账户下存在大额存单被冻结")
   */
  AC038("AC038", "该账户下存在大额存单被冻结"),

  /*
   * AC039("AC039", "该账户下存在大额存单被止付")
   */
  AC039("AC039", "该账户下存在大额存单被止付"),

  /*
   * AC040("AC040", "该账户下存在活力宝产品未销户")
   */
  AC040("AC040", "该账户下存在活力宝产品未销户"),

  /*
   * AC041("AC041", "该账户下存在活力宝产品被冻结")
   */
  AC041("AC041", "该账户下存在活力宝产品被冻结"),

  /*
   * AC042("AC042", "该账户下存在活力宝产品被止付")
   */
  AC042("AC042", "该账户下存在活力宝产品被止付"),

  /*
   * AC043("AC043", "该账户下存在其他存款产品未销户")
   */
  AC043("AC043", "该账户下存在其他存款产品未销户"),

  /*
   * AC044("AC044", "该账户下存在其他存款产品被冻结")
   */
  AC044("AC044", "该账户下存在其他存款产品被冻结"),

  /*
   * AC045("AC045", "该账户下存在其他存款产品被止付")
   */
  AC045("AC045", "该账户下存在其他存款产品被止付"),

  /*
   * AC046("AC046", "该账户销户信息正在处理")
   */
  AC046("AC046", "该账户销户信息正在处理"),

  /*
   * AC047("AC047", "该账户不可销户")
   */
  AC047("AC047", "该账户不可销户"),

  /*
   * AC048("AC048", "该账户存在未解约的子账户")
   */
  AC048("AC048", "该账户存在未解约的子账户"),

  /*
   * AC049("AC049", "未能获取电子帐号")
   */
  AC049("AC049", "未能获取电子帐号"),
  
  /*
   * AC050("AC050", "必须存在电子账户")
   */
  AC050("AC050", "必须存在电子账户"),
  
  /*
   * AC051("AC051", "账户序号类型不存在")
   */
  AC051("AC051", "账户序号类型不存在"),

  /*
   * AC052("AC052", "账户被锁定")
   */
  AC052("AC052", "登录密码已被锁定，请次日登录或通过“忘记密码”重置密码后再登录"),
  /*
   * AC053("AC053","本行不支持绑定该银行卡")
   */
  AC053("AC053","本行不支持绑定该银行卡"),
  /*
   * AC054("AC054","人脸识别已开启")
   */
  AC054("AC054","人脸识别已开启"),
  
  /*
   * AC055("AC055","人脸识别已关闭")
   */
  AC055("AC055","人脸识别已关闭"),
  
  /*
   * AC055("AC055","人脸识别已关闭")
   */
  AC056("AC056","查询信息为空"),
  
  
  /*
   * AC055("AC055","人脸识别已关闭")
   */
  AC057("AC057","更新数据失败"),
  
  /*
   * AC055("AC055","人脸识别已关闭")
   */
  AC058("AC058","插入信息失败"),
  
  /*
   * AC059("AC059","绑卡数量超出限制")
   */
  AC059("AC059","绑卡数量超出限制"),
  
  
  /*
   * AC059("AC059","真融宝信息查询出错")
   */
  AC060("AC060","真融宝信息查询出错"),
  AC061("AC061","真融宝找不到账户"),
  /*
   * AC062("AC062","电子账户销户失败")
   */
  AC062("AC062","电子账户销户失败"),
  /*
   * AC063("AC063", "该账户处于睡眠状态")
   */
  AC063("AC063", "该账户处于睡眠状态"),
  /*
   * AC064("AC064", "该账户处于没收状态")
   */
  AC064("AC064", "该账户处于没收状态"),
  /*
   * AC065("AC065", "该账户处于非活动状态")
   */
  AC065("AC065", "该账户处于非活动状态"),
  /*
   * AC066("AC066", "该账户中有余额存在")
   */
  AC066("AC066", "该账户中有余额存在"),
  /*
   * AC067("AC067", "该账户中有贷款未处理")
   */
  AC067("AC067", "该账户中有贷款未处理"),
  /*
   * AC068("AC068", "该账户名下有未销户的子账户")
   */
  AC068("AC068", "该账户名下有未销户的子账户"),
  /*
   * AC069("AC069", "查询借据信息不存在")
   */
  AC069("AC069", "查询借据信息不存在"),
  
  /*
   * BL002("BL002", "预防方法加一")
   */
  BL002("BL002", "预防方法加一"),

  /*
   * BL003("BL003", "客户系统崩溃")
   */
  BL003("BL003", "客户系统崩溃"),

  /*
   * BL004("BL004", "客户系统崩溃")
   */
  BL004("BL004", "客户系统崩溃"),

  /*
   * BS001("BS001", "传入参数错误")
   */
  BS001("BS001", "传入参数错误"),

  /*
   * BS002("BS002", "交易上下文中的交易码不存在")
   */
  BS002("BS002", "交易上下文中的交易码不存在"),

  /*
   * BS003("BS003", "文件解析错误")
   */
  BS003("BS003", "文件解析错误"),

  /*
   * BS004("BS004", "当前页面显示条数传入异常")
   */
  BS004("BS004", "当前页面显示条数传入异常"),

  /*
   * BS005("BS005", "当前页码数传入异常")
   */
  BS005("BS005", "当前页码数传入异常"),

  /*
   * BS006("BS006", "文件内容错误")
   */
  BS006("BS006", "文件内容错误"),

  /*
   * BS012("BS012", "消息模板不存在")
   */
  BS012("BS012", "消息模板不存在"),
  
  /*
   * BS013("BS013", "消息模板不存在")
   */
  BS013("BS013", "代发工资笔数核对失败，交易结束"),
  
  /*
   * BS014("BS014", "代发工资总金额核对失败，交易结束")
   */
  BS014("BS014", "代发工资总金额核对失败，交易结束"),
  
  /*
   * BS015("BS015", "指定开户行卡bin未找到")
   */
  BS015("BS015", "指定开户行卡bin未找到"),
  
  /*
   * CC001("CC001", "未查到此服务，故不可撤销")
   */
  CC001("CC001", "未查到此服务，故不可撤销"),

  /*
   * CC002("CC002", "此服务不支持撤销")
   */
  CC002("CC002", "此服务不支持撤销"),

  /*
   * CC003("CC003", "此撤销服务名与撤销交易不符")
   */
  CC003("CC003", "此撤销服务名与撤销交易不符"),

  /*
   * CC004("CC004", "非账务类暂不支持撤销")
   */
  CC004("CC004", "非账务类暂不支持撤销"),

  /*
   * CC005("CC005", "撤销服务名错误,不能撤回")
   */
  CC005("CC005", "撤销服务名错误,不能撤回"),

  /*
   * CC006("CC006", "单据撤销失败")
   */
  CC006("CC006", "单据撤销失败"),

  /*
   * CC007("CC007", "该笔流水不存业务,不可撤销")
   */
  CC007("CC007", "该笔流水不存业务,不可撤销"),

  /*
   * CC009("CC009", "撤销金额大于原交易金额")
   */
  CC009("CC009", "撤销金额大于原交易金额"),

  /*
   * CC010("CC010", "该笔流水不存在挂账")
   */
  CC010("CC010", "该笔流水不存在挂账"),

  /*
   * CC011("CC011", "支出账号不符,不能撤消")
   */
  CC011("CC011", "支出账号不符,不能撤消"),

  /*
   * CC012("CC012", "转入账号不符,不能撤消")
   */
  CC012("CC012", "转入账号不符,不能撤消"),

  /*
   * CC013("CC013", "转账金额不符,不能撤消")
   */
  CC013("CC013", "转账金额不符,不能撤消"),

  /*
   * CC014("CC014", "借贷标志不符,不能撤销")
   */
  CC014("CC014", "借贷标志不符,不能撤销"),
 
  /*
   * CC015("CC015", "转账失败")
   */
  CC015("CC015", "转账失败"),

  /*
   * CH001("CH001", "查询机构信息表失败")
   */
  CH001("CH001", "查询机构信息表失败"),

  /*
   * CH003("CH003", "查询渠道交易密码关系表出错")
   */
  CH003("CH003", "查询渠道交易密码关系表出错"),

  /*
   * CH004("CH004", "渠道密码关系表未设置")
   */
  CH004("CH004", "渠道密码关系表未设置"),
  
  /*
   * CH004("CH004", "渠道密码关系表未设置")
   */
  CH005("CH005", "您的交易密码被锁定，请前往我行网点进行重置"),

  /*
   * CT001("CT001", "证件号码输入不正确")
   */
  CT001("CT001", "证件号码输入不正确"),

  /*
   * CU001("CU001", "该客户为黑名单客户")
   */
  CU001("CU001", "该客户为黑名单客户"),

  /*
   * CU002("CU002", "客户不存在")
   */
  CU002("CU002", "客户不存在"),

  /*
   * CU003("CU003", "客户证件类型为空")
   */
  CU003("CU003", "客户证件类型为空"),

  /*
   * CU004("CU004", "客户证件号码为空")
   */
  CU004("CU004", "客户证件号码为空"),

  /*
   * CU005("CU005", "查询个人客户证件信息表错误")
   */
  CU005("CU005", "查询个人客户证件信息表错误"),

  /*
   * CU006("CU006", "介质与账户关系表中无此记录或状态不正常!")
   */
  CU006("CU006", "介质与账户关系表中无此记录或状态不正常!"),

  /*
   * CU007("CU007", "查询黑名单信息表错误")
   */
  CU007("CU007", "查询黑名单信息表错误"),

  /*
   * CU008("CU008", "传入客户操作标志有误")
   */
  CU008("CU008", "传入客户操作标志有误"),

  /*
   * CU009("CU009", "客户编号为空")
   */
  CU009("CU009", "客户编号为空"),

  /*
   * CU010("CU010", "查询电子账户登记簿错误")
   */
  CU010("CU010", "查询电子账户登记簿错误"),

  /*
   * CU011("CU011", "参数长度超过限制")
   */
  CU011("CU011", "参数长度超过限制"),

  /*
   * CU012("CU012", "客户号与注册手机号不匹配")
   */
  CU012("CU012", "客户号与注册手机号不匹配"),

  /*
   * CU013("CU013", "未查到可用的试题编号")
   */
  CU013("CU013", "未查到可用的试题编号"),

  /*
   * CU014("CU014", "客户风险评估登记薄中无此记录或状态不正常")
   */
  CU014("CU014", "客户风险评估登记薄中无此记录或状态不正常"),

  /*
   * CU015("CU015", "事件编号为空")
   */
  CU015("CU015", "事件编号为空"),

  /*
   * CU016("CU016", "审核状态不在预设范围内")
   */
  CU016("CU016", "审核状态不在预设范围内"),

  /*
   * CU017("CU017", "接收的数据格式无效")
   */
  CU017("CU017", "接收的数据格式无效"),

  /*
   * CU018("CU018", "传入数据不在预设范围内")
   */
  CU018("CU018", "传入数据不在预设范围内"),

  /*
   * CU019("CU019", "验证码错误")
   */
  CU019("CU019", "验证码错误,请重新录入"),

  /*
   * CU020("CU020", "此证件号码已注册电子账号")
   */
  CU020("CU020", "此证件号码已注册电子账号"),

  /*
   * CU021("CU021", "身份证号格式有误")
   */
  CU021("CU021", "身份证号格式有误"),

  /*
   * CU022("CU022", "该笔记录已经存在")
   */
  CU022("CU022", "该笔记录已经存在"),

  /*
   * CU023("CU023", "该笔记录不存在")
   */
  CU023("CU023", "该笔记录不存在"),

  /*
   * CU024("CU024", "客户证件与客户号不匹配")
   */
  CU024("CU024", "客户证件与客户号不匹配"),

  /*
   * CU025("CU025", "该客户已签约")
   */
  CU025("CU025", "该客户已签约"),

  /*
   * CU026("CU026", "该手机号码已注册")
   */
  CU026("CU026", "该手机号码已注册"),

  /*
   * CU027("CU027", "该证件号已建立客户号")
   */
  CU027("CU027", "该证件号已建立客户号"),

  /*
   * CU028("CU028", "没有此客户类型")
   */
  CU028("CU028", "没有此客户类型"),

  /*
   * CU029("CU029", "客户登陆失败")
   */
  CU029("CU029", "客户登陆失败"),

  /*
   * CU030("CU030", "客户密码状态不正常")
   */
  CU030("CU030", "客户密码状态不正常"),

  /*
   * CU031("CU031", "身份证号为空")
   */
  CU031("CU031", "身份证号为空"),

  /*
   * CU032("CU032", "身份证姓名为空")
   */
  CU032("CU032", "身份证姓名为空"),

  /*
   * CU033("CU033", "客户基本的信息为空")
   */
  CU033("CU033", "客户基本的信息为空"),

  /*
   * CU034("CU034", "密码输入错误")
   */
  CU034("CU034", "密码输入错误"),

  /*
   * CU035("CU035", "连续登陆密码错误次数超过限制")
   */
  CU035("CU035", "连续登陆密码错误次数超过限制"),

  /*
   * CU036("CU036", "密码类型有误")
   */
  CU036("CU036", "密码类型有误"),

  /*
   * CU037("CU037", "传入操作标志有误")
   */
  CU037("CU037", "传入操作标志有误"),

  /*
   * CU038("CU038", "客户信息参数不能为空")
   */
  CU038("CU038", "客户信息参数不能为空"),

  /*
   * CU039("CU039", "该邮箱已经注册")
   */
  CU039("CU039", "该邮箱已经注册"),

  /*
   * CU040("CU040", "验证码超时时间未设定，检查COM_PARM")
   */
  CU040("CU040", "验证码超时时间未设定，检查COM_PARM"),

  /*
   * CU041("CU041", "验证码已经超时,请重新获取")
   */
  CU041("CU041", "验证码已经超时,请重新获取"),

  /*
   * CU042("CU042", "电子回单数据设定错误")
   */
  CU042("CU042", "电子回单数据设定错误"),

  /*
   * CU043("CU043", "客户类型获取失败")
   */
  CU043("CU043", "客户类型获取失败"),

  /*
   * CU044("CU044", "卡号，电子账号，密码不能为空")
   */
  CU044("CU044", "卡号，电子账号，密码不能为空"),

  /*
   * CU045("CU045", "密码验证不通过")
   */
  CU045("CU045", "密码验证不通过"),

  /*
   * CU046("CU046", "该卡号已经被绑定")
   */
  CU046("CU046", "该卡号已经被绑定"),

  /*
   * CU047("CU047", "该证件号已建立内管操作员号")
   */
  CU047("CU047", "该证件号已建立内管操作员号"),

  /*
   * CU048("CU048", "传入的客户标示头与客户类型不一致")
   */
  CU048("CU048", "传入的客户标示头与客户类型不一致"),

  /*
   * CU049("CU049", "登记客户签约信息失败")
   */
  CU049("CU049", "登记客户签约信息失败"),

  /*
   * CU050("CU050", "客户签约信息异常")
   */
  CU050("CU050", "客户签约信息异常"),

  /*
   * CU051("CU051", "客户签约信息异常或未签约")
   */
  CU051("CU051", "客户签约信息异常或未签约"),

  /*
   * CU052("CU052", "电子账号为空")
   */
  CU052("CU052", "电子账号为空"),

  /*
   * CU053("CU053", "客户证件已经注销")
   */
  CU053("CU053", "客户证件已经注销"),

  /*
   * CU054("CU054", "证件类型错误")
   */
  CU054("CU054", "证件类型错误"),

  /*
   * CU055("CU055", "证件信息不存在")
   */
  CU055("CU055", "证件信息不存在"),

  /*
   * CU056("CU056", "客户已经注销")
   */
  CU056("CU056", "客户已经注销"),

  /*
   * CU057("CU057", "该客户没有注册")
   */
  CU057("CU057", "该客户没有注册"),

  /*
   * CU058("CU058", "客户状态不能为空")
   */
  CU058("CU058", "客户状态不能为空"),

  /*
   * CU059("CU059", "客户信息不存在")
   */
  CU059("CU059", "客户信息不存在"),

  /*
   * CU060("CU060", "客户证件信息状态异常")
   */
  CU060("CU060", "客户证件信息状态异常"),

  /*
   * CU061("CU061", "客户基本信息表写入失败")
   */
  CU061("CU061", "客户基本信息表写入失败"),

  /*
   * CU063("CU063", "客户证件信息写入失败")
   */
  CU063("CU063", "客户证件信息写入失败"),

  /*
   * CU064("CU064", "个人客户信息写入失败")
   */
  CU064("CU064", "个人客户信息写入失败"),

  /*
   * CU065("CU065", "公司客户信息写入失败")
   */
  CU065("CU065", "公司客户信息写入失败"),

  /*
   * CU066("CU066", "客户登陆日志写入失败")
   */
  CU066("CU066", "客户登陆日志写入失败"),

  /*
   * CU067("CU067", "证件信息状态正常，已经开户")
   */
  CU067("CU067", "证件信息状态正常，已经开户"),

  /*
   * CU068("CU068", "查询客户基本信息表失败")
   */
  CU068("CU068", "查询客户基本信息表失败"),

  /*
   * CU069("CU069", "登记客户重要信息变更登记薄失败")
   */
  CU069("CU069", "登记客户重要信息变更登记薄失败"),

  /*
   * CU070("CU070", "登记企业操作员状态为未激活时失败")
   */
  CU070("CU070", "登记企业操作员状态为未激活时失败"),

  /*
   * CU071("CU071", "内管操作员已停用")
   */
  CU071("CU071", "内管操作员已停用"),

  /*
   * CU072("CU072", "账卡号为空")
   */
  CU072("CU072", "账卡号为空"),

  /*
   * CU073("CU073", "登记挂失登记簿失败")
   */
  CU073("CU073", "登记挂失登记簿失败"),

  /*
   * CU074("CU074", "已经登记挂失登记簿")
   */
  CU074("CU074", "已经登记挂失登记簿"),

  /*
   * CU075("CU075", "客户没有挂失账卡号")
   */
  CU075("CU075", "客户没有挂失账卡号"),

  /*
   * CU076("CU076", "解挂账号失败")
   */
  CU076("CU076", "解挂账号失败"),

  /*
   * CU077("CU077", "客户账号正常，无需解挂")
   */
  CU077("CU077", "客户账号正常，无需解挂"),

  /*
   * CU078("CU078", "该客户权限尚未分配")
   */
  CU078("CU078", "该客户权限尚未分配"),

  /*
   * CU079("CU079", "账户处于申请状态")
   */
  CU079("CU079", "账户处于申请状态"),

  /*
   * CU080("CU080", "该手机号尚未找到所属的公司信息")
   */
  CU080("CU080", "该手机号尚未找到所属的公司信息"),

  /*
   * CU081("CU081", "当前内管角色尚在使用中")
   */
  CU081("CU081", "当前内管角色尚在使用中"),

  /*
   * CU082("CU082", "查询风险评估试题返回为空")
   */
  CU082("CU082", "查询风险评估试题返回为空"),

  /*
   * CU083("CU083", "客户号格式不正确，只支持数字")
   */
  CU083("CU083", "客户号格式不正确，只支持数字"),

  /*
   * CU084("CU084", "更新账号绑定关系失败")
   */
  CU084("CU084", "更新账号绑定关系失败"),

  /*
   * CU085("CU085", "获取流水表中数据出错")
   */
  CU085("CU085", "获取流水表中数据出错"),

  /*
   * CU086("CU086", "查询结果为空")
   */
  CU086("CU086", "查询结果为空"),

  /*
   * CU087("CU087", "启用手势密码为空")
   */
  CU087("CU087", "启用手势密码为空"),

  /*
   * CU088("CU088", "添加客户操作日志失败")
   */
  CU088("CU088", "添加客户操作日志失败"),

  /*
   * CU089("CU089", "获取的随机码为空")
   */
  CU089("CU089", "获取的随机码为空"),

  /*
   * CU090("CU090", "电子账户绑定表中无此电子账户记录")
   */
  CU090("CU090", "电子账户绑定表中无此电子账户记录"),

  /*
   * CU092("CU092", "查询基本信息表已经注销")
   */
  CU092("CU092", "查询基本信息表已经注销"),

  /*
   * CU093("CU093", "证件号码不匹配")
   */
  CU093("CU093", "证件号码不匹配"),

  /*
   * CU094("CU094", "证件类型不存在")
   */
  CU094("CU094", "证件类型不存在"),

  /*
   * CU095("CU095", "查询密码提示问题为空")
   */
  CU095("CU095", "查询密码提示问题为空"),

  /*
   * CU096("CU096", "密码安全提示问题表异常")
   */
  CU096("CU096", "密码安全提示问题表异常"),

  /*
   * CU099("CU099", "核心生成客户号失败")
   */
  CU099("CU099", "核心生成客户号失败"),

  /*
   * CU100("CU100", "生成客户号失败")
   */
  CU100("CU100", "生成客户号失败"),

  /*
   * CU101("CU101", "处理传入密码有误")
   */
  CU101("CU101", "处理传入密码有误"),

  /*
   * CU102("CU102", "登记客户号映射表异常")
   */
  CU102("CU102", "登记客户号映射表异常"),

  /*
   * CU103("CU103", "客户登陆信息查询失败")
   */
  CU103("CU103", "客户登陆信息查询失败"),

  /*
   * CU105("CU105", "模板文件读取失败")
   */
  CU105("CU105", "模板文件读取失败"),

  /*
   * CU106("CU106", "文档生成失败")
   */
  CU106("CU106", "文档生成失败"),

  /*
   * CU107("CU107", "客户状态与当前业务不符")
   */
  CU107("CU107", "客户状态与当前业务不符"),

  /*
   * CU108("CU108", "已经提交同类审核,信息已在申请中,请等候审核")
   */
  CU108("CU108", "已经提交同类审核,信息已在申请中,请等候审核"),

  /*
   * CU109("CU109", "订单类型查询失败")
   */
  CU109("CU109", "订单类型查询失败"),

  /*
   * CU110("CU110", "订单抵扣内部序号获取失败")
   */
  CU110("CU110", "订单抵扣内部序号获取失败"),

  /*
   * CU111("CU111", "账户不存在")
   */
  CU111("CU111", "账户不存在"),

  /*
   * CU112("CU112", "当前订单流程下，指定动作的步骤不存在")
   */
  CU112("CU112", "当前订单流程下，指定动作的步骤不存在"),

  /*
   * CU113("CU113", "订单编号查询失败")
   */
  CU113("CU113", "订单编号查询失败"),

  /*
   * CU114("CU114", "订单流水编号与订单编号不是一一对应关系")
   */
  CU114("CU114", "订单流水编号与订单编号不是一一对应关系"),

  /*
   * CU116("CU116", "订单流程或订单步骤查询失败")
   */
  CU116("CU116", "订单流程或订单步骤查询失败"),

  /*
   * CU118("CU118", "订单上一步骤执行失败")
   */
  CU118("CU118", "订单上一步骤执行失败"),

  /*
   * CU122("CU122", "订单执行失败是否停留等信息查询失败")
   */
  CU122("CU122", "订单执行失败是否停留等信息查询失败"),

  /*
   * CU123("CU123", "订单执行记录表插入失败")
   */
  CU123("CU123", "订单执行记录表插入失败"),

  /*
   * CU124("CU124", "订单主表状态更新失败")
   */
  CU124("CU124", "订单主表状态更新失败"),

  /*
   * CU125("CU125", "订单区间查询失败")
   */
  CU125("CU125", "订单区间查询失败"),

  /*
   * CU126("CU126", "客户订单查询失败")
   */
  CU126("CU126", "客户订单查询失败"),

  /*
   * CU127("CU127", "订单详情查询失败")
   */
  CU127("CU127", "订单详情查询失败"),

  /*
   * CU128("CU128", "订单查询拓展表失败")
   */
  CU128("CU128", "订单查询拓展表失败"),

  /*
   * CU129("CU129", "记录证件号和证件类型异常！")
   */
  CU129("CU129", "记录证件号和证件类型异常！"),

  /*
   * CU130("CU130", "手机号已注册，证件类型与原证件类型不同")
   */
  CU130("CU130", "手机号已注册，证件类型与原证件类型不同"),

  /*
   * CU131("CU131", "该证件已注册，输入手机号与证件号不匹配")
   */
  CU131("CU131", "该证件已注册，输入手机号与证件号不匹配"),

  /*
   * CU132("CU132", "该证件已注册，输入户名与证件号不匹配")
   */
  CU132("CU132", "该证件已注册，输入户名与证件号不匹配"),

  /*
   * CU133("CU133", "该手机号已注册，邮箱与原用户邮箱不同")
   */
  CU133("CU133", "该手机号已注册，邮箱与原用户邮箱不同"),

  /*
   * CU134("CU134", "内部账号和内部账号序号不存在或者查询失败")
   */
  CU134("CU134", "内部账号和内部账号序号不存在或者查询失败"),

  /*
   * CU135("CU135", "该证件已注册，输入邮箱与证件号不匹配")
   */
  CU135("CU135", "该证件已注册，输入邮箱与证件号不匹配"),

  /*
   * CU136("CU136", "该证件已注册，输入密码与证件号不匹配")
   */
  CU136("CU136", "该证件已注册，输入密码与证件号不匹配"),

  /*
   * CU137("CU137", "当前类型的文件获取方式尚未实现")
   */
  CU137("CU137", "当前类型的文件获取方式尚未实现"),

  /*
   * CU138("CU138", "利率查询标志有误")
   */
  CU138("CU138", "利率查询标志有误"),

  /*
   * CU139("CU139", "查询更改手机号/密码申请信息为空")
   */
  CU139("CU139", "查询更改手机号/密码申请信息为空"),

  /*
   * CU140("CU140", "证件类型映射失败")
   */
  CU140("CU140", "证件类型映射失败"),

  /*
   * CU141("CU141", "证件类型不匹配")
   */
  CU141("CU141", "证件类型不匹配"),

  /*
   * CU142("CU142", "证件号不匹配")
   */
  CU142("CU142", "证件号不匹配"),

  /*
   * CU143("CU143", "法人机构不匹配")
   */
  CU143("CU143", "法人机构不匹配"),

  /*
   * CU144("CU144", "密码输入有误")
   */
  CU144("CU144", "密码输入有误"),

  /*
   * CU145("CU145", "获取密码错误")
   */
  CU145("CU145", "获取密码错误"),

  /*
   * CU146("CU146", "该客户已注册过，请检查账户信息")
   */
  CU146("CU146", "该客户已注册过，请检查账户信息"),

  /*
   * CU147("CU147", "获取时间戳错误")
   */
  CU147("CU147", "获取时间戳错误"),

  /*
   * CU148("CU148", "获取登录密码错误次数异常")
   */
  CU148("CU148", "获取登录密码错误次数异常"),

  /*
   * CU149("CU149", "查询字段为空")
   */
  CU149("CU149", "查询字段为空"),

  /*
   * CU150("CU150", "获取证件号和证件类型异常")
   */
  CU150("CU150", "获取证件号和证件类型异常"),

  /*
   * CU151("CU151", "客户风险评估等级不存在")
   */
  CU151("CU151", "客户风险评估等级不存在"),

  /*
   * CU152("CU152", "是否本行卡标志查询错误")
   */
  CU152("CU152", "是否本行卡标志查询错误"),

  /*
   * CU153("CU153", "查询账户详细信息失败")
   */
  CU153("CU153", "查询账户详细信息失败"),

  /*
   * CU154("CU154", "该客户号是黑名单用户")
   */
  CU154("CU154", "该客户号是黑名单用户"),

  /*
   * CU155("CU155", "添加客户分组信息失败")
   */
  CU155("CU155", "添加客户分组信息失败"),

  /*
   * CU156("CU156", "新的分组编号不存在")
   */
  CU156("CU156", "新的分组编号不存在"),

  /*
   * CU157("CU157", "查询试卷信息失败")
   */
  CU157("CU157", "查询试卷信息失败"),

  /*
   * CU158("CU158", "获取客户号生成规则失败")
   */
  CU158("CU158", "获取客户号生成规则失败"),

  /*
   * CU159("CU159", "机构标志为空")
   */
  CU159("CU159", "机构标志为空"),

  /*
   * CU160("CU160", "查询客户经理信息为空")
   */
  CU160("CU160", "查询客户经理信息为空"),

  /*
   * CU161("CU161", "输入的最小分数不能大于最大分数")
   */
  CU161("CU161", "输入的最小分数不能大于最大分数"),

  /*
   * CU162("CU162", "该状态未定义，不执行任何操作")
   */
  CU162("CU162", "该状态未定义，不执行任何操作"),

  /*
   * CU163("CU163", "查询风险评估规则异常")
   */
  CU163("CU163", "查询风险评估规则异常"),

  /*
   * CU164("CU164", "试题编号和试题答案个数不相等")
   */
  CU164("CU164", "试题编号和试题答案个数不相等"),

  /*
   * CU165("CU165", "客户风险评估实体选项维护失败")
   */
  CU165("CU165", "客户风险评估实体选项维护失败"),

  /*
   * CU166("CU166", "试题库没有找到该试题")
   */
  CU166("CU166", "试题库没有找到该试题"),

  /*
   * CU167("CU167", "查询客户风险评估试题评分规则描述不存在")
   */
  CU167("CU167", "查询客户风险评估试题评分规则描述不存在"),

  /*
   * CU168("CU168", "传入评分分数出错")
   */
  CU168("CU168", "传入评分分数出错"),

  /*
   * CU169("CU169", "登记评估结果失败")
   */
  CU169("CU169", "登记评估结果失败"),

  /*
   * CU170("CU170", "登记评估结果为空")
   */
  CU170("CU170", "登记评估结果为空"),

  /*
   * CU171("CU171", "该客户证件状态已注销")
   */
  CU171("CU171", "该客户证件状态已注销"),

  /*
   * CU172("CU172", "客户证件信息表查询出错")
   */
  CU172("CU172", "客户证件信息表查询出错"),

  /*
   * CU173("CU173", "查询客户风险评估试题评分规则描述失败")
   */
  CU173("CU173", "查询客户风险评估试题评分规则描述失败"),

  /*
   * CU174("CU174", "查询证件信息表错误")
   */
  CU174("CU174", "查询证件信息表错误"),

  /*
   * CU175("CU175", "查询客户基本信息表错误")
   */
  CU175("CU175", "查询客户基本信息表错误"),

  /*
   * CU176("CU176", "查询登陆信息表错误")
   */
  CU176("CU176", "查询登陆信息表错误"),

  /*
   * CU177("CU177", "插入登陆日志出错")
   */
  CU177("CU177", "插入登陆日志出错"),

  /*
   * CU178("CU178", "查询公司内部操作员表错误")
   */
  CU178("CU178", "查询公司内部操作员表错误"),

  /*
   * CU179("CU179", "更新登录信息表错误")
   */
  CU179("CU179", "更新登录信息表错误"),

  /*
   * CU180("CU180", "密码正确更新登录信息表错误")
   */
  CU180("CU180", "密码正确更新登录信息表错误"),

  /*
   * CU181("CU181", "获取手势密码错误")
   */
  CU181("CU181", "获取手势密码错误"),

  /*
   * CU182("CU182", "操作员信息表查询有误")
   */
  CU182("CU182", "操作员信息表查询有误"),

  /*
   * CU183("CU183", "该内管人员已经停用")
   */
  CU183("CU183", "该内管人员已经停用"),

  /*
   * CU184("CU184", "该客户在黑名单中")
   */
  CU184("CU184", "该客户在黑名单中"),

  /*
   * CU185("CU185", "证件号/证件类型错误")
   */
  CU185("CU185", "证件号/证件类型错误"),
  
  /*
   * CU186("CU186", "请求措施类型为空")
   */
  CU186("CU186", "请求措施类型为空"),

  /*
   * CU187("CU187", "证件类型转换失败")
   */
  CU187("CU187", "证件类型转换失败"),

  /*
   * CU188("CU188", "核心生成电子账号失败")
   */
  CU188("CU188", "核心生成电子账号失败"),
  
  /*
   * CU189("CU189", "第三方机构号不存在")
   */
  CU189("CU189", "第三方机构号不存在"),
  
  /*
   * CU193("CU193", "该设备未绑定，请获取短信验证码")
   */
  CU193("CU193", "该设备未绑定，请获取短信验证码"),
  /*
   * CU198("CU198", "新密码不能与旧密码相同")
   */
  CU198("CU198", "新密码不能与旧密码相同"),
  /*
   * CU199("CU199", "登录名错误，请重试")
   */
  CU199("CU199", "登录名错误，请重试"),
  
  /*
   * CU200("CU200", "证件信息联网核查")
   */
  CU200("CU200", "证件信息联网核查"),
  
  /*
   * CU201("CU201", "请获取短信验证码")
   */
  CU201("CU201", "请获取短信验证码"),
  

  /*
   * CU202("CU202","客户影像信息失效");
   */
  CU202("CU202","客户影像信息失效"),
  
  /*
   * CU203("CU203","客户影像信息待审核");
   */
  CU203("CU203","客户影像信息待审核"),
  
  /*
   * CU204("CU204","公安部影像信息错误");
   */
  CU204("CU204","公安部影像信息错误"),
  
  /*
   * CU205("CU205","OCR影像信息错误");
   */
  CU205("CU205","OCR影像信息错误"),
  
  /*
   * CU206("CU206","客户证件正面信息错误");
   */
  CU206("CU206","客户证件正面信息错误"),
  
  /*
   * CU207("CU207","客户证件反面信息错误");
   */
  CU207("CU207","客户证件反面信息错误"),
  
  /*
   * CU208("CU208","客户证件反面信息错误");
   */
  CU208("CU208","卡信息验证错误"),
  /*
   * CU209("CU209","该客户已经加入其他圈子");
   */
  CU209("CU209","该客户已经加入其他圈子"),
  /*
   * CU211("CU211","客户不是圈主，没有操作权限");
   */
  CU211("CU211","客户不是圈主，没有操作权限"),
  /*
   * CU212("CU212","圈子已经申请解散或者已经关闭");
   */
  CU212("CU212","圈子已经申请解散或者已经关闭"),
  /*
   * CU213("CU213","被邀请人没有注册或登录");
   */
  CU213("CU213","被邀请人没有注册或登录"),
  /*
   * CU214("CU214","该客户已经永久禁止加入该圈");
   */
  CU214("CU214","该客户已经永久禁止加入该圈"),
  /*
   * CU215("CU215","该客户已经申请加入该圈");
   */
  CU215("CU215","该客户已经申请加入该圈"),
  /*
   * CU216("CU216","邀请码输入错误");
   */
  CU216("CU216","邀请码输入错误"),
  /*
   * CU217("CU217"," 邀请码已经失效");
   */
  CU217("CU217"," 邀请码已经失效"),
  /*
   * CU218("CU218","你已经退出该圈子");
   */
  CU218("CU218","你已经退出该圈子"),
  /*
   * CU219("CU219","您暂时还没有被邀请");
   */
  CU219("CU219","您暂时还没有被邀请"),
  /*
   * DB001("DB001", "数据库连接失败")
   */
  CU220("CU220","锁定圈子已经被锁定"),
  /*
   * CU220("CU220","锁定圈子已经被锁定");
   */
  CU221("CU221","客户是圈主，不能退出圈子"),
  /*
   * CU222("CU222","核心绑卡或者解绑卡失败");
   */
  CU222("CU222","核心绑卡或者解绑卡失败"),
  /*
   *  CU223("CU223","单笔单账户核验失败"),
   */
  CU223("CU223","单笔单账户核验失败"),
  /*
   * CU224("CU224","单笔双账户核验失败"),
   */
  CU224("CU224","单笔双账户核验失败"),
  /*
   * CU225("CU225","核心绑卡或者解绑卡失败");
   */
  CU225("CU225","卡信息五要素验证失败"),
  /*
   * CU226("CU226","影像平台上传失败");
   */
  CU226("CU226","影像平台上传失败"),
  /*
 * CU227("CU227","核心验密失败");
 */
  CU227("CU227","核心验密失败"),
  
   /*
 * CU228("CU228","该手机号修改正在审核中");
 */
  CU228("CU228","该手机号修改正在审核中"),
  /*
   * CU229("CU229","电子账号不存在");
   */
  CU229("CU229","电子账号不存在"),
  /*
   * CU230("CU230","查询核心客户信息错误");
   */
  CU230("CU230","查询核心查询信息错误"),
  
  /*
   * CU231("CU231","查询核心客户信息错误");
   */
  CU231("CU231","联机批量信息主表未查询到数据"),
  /*
   * CU232("CU231","联机批量状态");
   */
  CU232("CU232","联机批量状态   "),
  /*
   * CU233("CU233","非补贴企业客户");
   */
  CU233("CU233","非补贴企业客户"),
  
  DB001("DB001", "数据库连接失败"),
  /*
   * DB002("DB002", "单笔记录查询失败")
   */
  DB002("DB002", "单笔记录查询失败"),

  /*
   * DB003("DB003", "多行查询失败")
   */
  DB003("DB003", "多行查询失败"),

  /*
   * DB004("DB004", "数据删除失败")
   */
  DB004("DB004", "数据删除失败"),

  /*
   * DB005("DB005", "数据更新失败")
   */
  DB005("DB005", "数据更新失败"),

  /*
   * DB006("DB006", "数据插入失败")
   */
  DB006("DB006", "数据插入失败"),

  /*
   * DB007("DB007", "获取插入语句失败")
   */
  DB007("DB007", "获取插入语句失败"),

  /*
   * DB008("DB008", "查询数据不存在")
   */
  DB008("DB008", "查询数据不存在"),

  /*
   * DB009("DB009", "查询结果中，指定栏位不存在")
   */
  DB009("DB009", "查询结果中，指定栏位不存在"),

  /*
   * DB010("DB010", "多笔记录查询失败")
   */
  DB010("DB010", "多笔记录查询失败"),

  /*
   * DB011("DB011", "获取查询语句失败")
   */
  DB011("DB011", "获取查询语句失败"),

  /*
   * DB012("DB012", "获取指定序号失败")
   */
  DB012("DB012", "获取指定序号失败"),

  /*
   * DB013("DB013", "该笔数据已存在！")
   */
  DB013("DB013", "该笔数据已存在！"),

  /*
   * DB014("DB014", "获取卡bin参数错误")
   */
  DB014("DB014", "获取卡bin参数错误"),

  /*
   * DB015("DB015", "生成外部帐号失败")
   */
  DB015("DB015", "生成外部帐号失败"),

  /*
   * DB016("DB016", "查询存款明细表错误")
   */
  DB016("DB016", "查询存款明细表错误"),

  /*
   * DB017("DB017", "查询结息登记簿明细表出错")
   */
  DB017("DB017", "查询结息登记簿明细表出错"),

  /*
   * DB018("DB018", "查询分段积数表错误")
   */
  DB018("DB018", "查询分段积数表错误"),

  /*
   * DB019("DB019", "查询数据库序列出错")
   */
  DB019("DB019", "查询数据库序列出错"),

  /*
   * DB020("DB020", "获取最新版本失败")
   */
  DB020("DB020", "获取最新版本失败"),

  /*
   * DB021("DB021", "已经取消对该产品的收藏")
   */
  DB021("DB021", "已经取消对该产品的收藏"),

  /*
   * DB023("DB023", "插入客户签约信息表异常")
   */
  DB023("DB023", "插入客户签约信息表异常"),

  /*
   * DB024("DB024", "更新存款附属表异常")
   */
  DB024("DB024", "更新存款附属表异常"),

  /*
   * DB025("DB025", "更新留存金额失败")
   */
  DB025("DB025", "更新留存金额失败"),

  /*
   * DB026("DB026", "更新客户签约产品信息表异常")
   */
  DB026("DB026", "更新客户签约产品信息表异常"),

  /*
   * DB027("DB027", "更新签约信息表失败")
   */
  DB027("DB027", "更新签约信息表失败"),

  /*
   * DB028("DB028", "查询客户签约信息失败")
   */
  DB028("DB028", "查询客户签约信息失败"),

  /*
   * DB029("DB029", "查询客户信息表异常")
   */
  DB029("DB029", "查询客户信息表异常"),

  /*
   * DB030("DB030", "流水记录数据插入失败")
   */
  DB030("DB030", "流水记录数据插入失败"),

  /*
   * DB031("DB031", "该帐号无扣划信息")
   */
  DB031("DB031", "该帐号无扣划信息"),

  /*
   * DB032("DB032", "产品收藏失败")
   */
  DB032("DB032", "产品收藏失败"),

  /*
   * DB033("DB033", "数据库中数据出错")
   */
  DB033("DB033", "数据库中数据出错"),
  /*
   * DB034("DB034", "数据库中数据出错")
   */
  DB034("DB034", "数据库中数据出错"),
/*
 *  DB035("DB035","存在计划任务未完成")
 */
  DB035("DB035","存在计划任务未完成"),

  /*
   * DN001("DN001", "短信验证不正确")
   */
  DN001("DN001", "短信验证不正确"),

  /*
   * DT001("DT001", "日期格式错误")
   */
  DT001("DT001", "日期格式错误"),

  /*
   * DT002("DT002", "开始日期不能大于结束日期")
   */
  DT002("DT002", "开始日期不能大于结束日期"),

  /*
   * DT003("DT003", "当前日期超出范围")
   */
  DT003("DT003", "当前日期超出范围"),

  /*
   * DT004("DT004", "未获取系统日期")
   */
  DT004("DT004", "未获取系统日期"),

  /*
   * DT005("DT005", "日期不合法")
   */
  DT005("DT005", "日期不合法"),

  /*
   * DT006("DT006", "试算码已失效")
   */
  DT006("DT006", "试算码已失效"),

  /*
   * DT007("DT007", "测试，日期相关")
   */
  DT007("DT007", "测试，日期相关"),
  
  /*
   * DT0010("DT010", "证件到期日小于系统日期")
   */
  DT010("DT010", "证件到期日小于系统日期"),

  /*
   * DU002("DU002", "产品工厂扣划失败")
   */
  DU002("DU002", "产品工厂扣划失败"),

  /*
   * DW001("DW001", "查询活期存款主文件表出错")
   */
  DW001("DW001", "查询活期存款主文件表出错"),

  /*
   * DW002("DW002", "不存在该活期账户")
   */
  DW002("DW002", "不存在该活期账户"),

  /*
   * DW003("DW003", "超过活期取款单笔限额")
   */
  DW003("DW003", "超过活期取款单笔限额"),

  /*
   * DW004("DW004", "该账户状态不能取款")
   */
  DW004("DW004", "该账户状态不能取款"),

  /*
   * DW005("DW005", "修改内部账户主文件发生错误")
   */
  DW005("DW005", "修改内部账户主文件发生错误"),

  /*
   * DW006("DW006", "新增内部账明细表发生错误")
   */
  DW006("DW006", "新增内部账明细表发生错误"),

  /*
   * DW007("DW007", "产品参数序号不存在")
   */
  DW007("DW007", "产品参数序号不存在"),

  /*
   * DW008("DW008", "查询内部帐主文件表出错")
   */
  DW008("DW008", "查询内部帐主文件表出错"),

  /*
   * DW009("DW009", "不存在该内部账户")
   */
  DW009("DW009", "不存在该内部账户"),

  /*
   * DW010("DW010", "更新存款主表失败")
   */
  DW010("DW010", "更新存款主表失败"),

  /*
   * DW011("DW011", "账户余额不足")
   */
  DW011("DW011", "账户余额不足"),

  /*
   * DW012("DW012", "查询存款主表数据为空")
   */
  DW012("DW012", "查询存款主表数据为空"),

  /*
   * DW013("DW013", "有效余额为空")
   */
  DW013("DW013", "有效余额为空"),

  /*
   * DW014("DW014", "该账户不是绑定账户,不允许转出")
   */
  DW014("DW014", "该账户不是绑定账户,不允许转出"),

  /*
   * DW015("DW015", "登记交易流水失败")
   */
  DW015("DW015", "登记交易流水失败"),

  /*
   * DW016("DW016", "登记开销户登记簿失败")
   */
  DW016("DW016", "登记开销户登记簿失败"),

  /*
   * DW017("DW017", "生成账户序号失败")
   */
  DW017("DW017", "生成账户序号失败"),

  /*
   * DW018("DW018", "生成内部账号失败")
   */
  DW018("DW018", "生成内部账号失败"),

  /*
   * DW019("DW019", "户名与账号不符")
   */
  DW019("DW019", "户名与账号不符"),

  /*
   * DW020("DW020", "证件与账号不符")
   */
  DW020("DW020", "证件与账号不符"),

  /*
   * DW021("DW021", "抵扣金额大于支付金额")
   */
  DW021("DW021", "抵扣金额大于支付金额"),

  /*
   * DW022("DW022", "请先设置交易密码!")
   */
  DW022("DW022", "请先设置交易密码!"),

  /*
   * DW023("DW023", "限额条件不满足")
   */
  DW023("DW023", "限额条件不满足"),

  /*
   * DW024("DW024", "不存在交易明细")
   */
  DW024("DW024", "不存在交易明细"),

  /*
   * DW025("DW025", "该账户已完全冻结")
   */
  DW025("DW025", "该账户已完全冻结"),

  /*
   * DW026("DW026", "该账户已全部止付")
   */
  DW026("DW026", "该账户已全部止付"),

  /*
   * DW027("DW027", "账户状态异常")
   */
  DW027("DW027", "账户状态异常"),

  /*
   * DW028("DW028", "该补账流水已存在")
   */
  DW028("DW028", "该补账流水已存在"),

  /*
   * DW029("DW029", "查询存款主表错误")
   */
  DW029("DW029", "查询存款主表错误"),

  /*
   * DW030("DW030", "当前账户状态:开户待确认")
   */
  DW030("DW030", "当前账户状态:开户待确认"),

  /*
   * DW031("DW031", "当前账户状态:开户确认否决")
   */
  DW031("DW031", "当前账户状态:开户确认否决"),

  /*
   * DW032("DW032", "当前账户状态:挂失结清")
   */
  DW032("DW032", "当前账户状态:挂失结清"),

  /*
   * DW033("DW033", "当前账户状态:开户更正")
   */
  DW033("DW033", "当前账户状态:开户更正"),

  /*
   * DW034("DW034", "当前账户状态:临时销户")
   */
  DW034("DW034", "当前账户状态:临时销户"),

  /*
   * DW035("DW035", "当前账户状态:转久悬")
   */
  DW035("DW035", "当前账户状态:转久悬"),

  /*
   * DW036("DW036", "当前账户状态:销户申请零余额")
   */
  DW036("DW036", "当前账户状态:销户申请零余额"),

  /*
   * DW037("DW037", "当前账户状态:销户申请")
   */
  DW037("DW037", "当前账户状态:销户申请"),

  /*
   * DW038("DW038", "当前账户状态:挂失销户")
   */
  DW038("DW038", "当前账户状态:挂失销户"),

  /*
   * DW039("DW039", "当前账户状态:销户")
   */
  DW039("DW039", "当前账户状态:销户"),

  /*
   * DW040("DW040", "未查询到该客户的密码信息")
   */
  DW040("DW040", "未查询到该客户的密码信息"),

  /*
   * DW041("DW041", "交易密码设置失败")
   */
  DW041("DW041", "交易密码设置失败"),

  /*
   * DW042("DW042", "修改密码失败")
   */
  DW042("DW042", "修改密码失败"),

  /*
   * DW043("DW043", "密码提示查询失败")
   */
  DW043("DW043", "密码提示查询失败"),
  /*
   * DW044("DW044", "对公交易不支持个人电子账户")
   */
  DW044("DW044", "对公交易不支持个人电子账户"),
  /*
   * DW045("DW045", "两账户之间不允许进行转账交易")
   */
  DW045("DW045", "两账户之间不允许进行转账交易"),
  /*
   * ED001("ED001", "未查询到待执行任务信息")
   */
  ED001("ED001", "未查询到待执行任务信息"),

  /*
   * ED002("ED002", "执行服务器不能满足任务性能条件")
   */
  ED002("ED002", "执行服务器不能满足任务性能条件"),

  /*
   * ED003("ED003", "执行服务器发生数据库错误")
   */
  ED003("ED003", "执行服务器发生数据库错误"),

  /*
   * ED004("ED004", "获取开始日期失败")
   */
  ED004("ED004", "获取开始日期失败"),

  /*
   * FN001("FN001", "查询产品基本信息表出错")
   */
  FN001("FN001", "查询产品基本信息表出错"),

  /*
   * FN002("FN002", "已存在此产品编号")
   */
  FN002("FN002", "已存在此产品编号"),

  /*
   * FN003("FN003", "插入产品基本信息表错误")
   */
  FN003("FN003", "插入产品基本信息表错误"),

  /*
   * FN004("FN004", "不存在此产品信息")
   */
  FN004("FN004", "不存在此产品信息"),

  /*
   * FN005("FN005", "此产品不允许删除")
   */
  FN005("FN005", "此产品不允许删除"),

  /*
   * FN006("FN006", "更改产品基本信息表错误")
   */
  FN006("FN006", "更改产品基本信息表错误"),

  /*
   * FN007("FN007", "此产品不允许发布")
   */
  FN007("FN007", "此产品不允许发布"),

  /*
   * FN008("FN008", "此产品不允许预约")
   */
  FN008("FN008", "此产品不允许预约"),

  /*
   * FN009("FN009", "不存在符合条件的产品")
   */
  FN009("FN009", "不存在符合条件的产品"),

  /*
   * FN010("FN010", "查询产品参数表出错")
   */
  FN010("FN010", "查询产品参数表出错"),

  /*
   * FN011("FN011", "没有符合此产品条件的参数")
   */
  FN011("FN011", "没有符合此产品条件的参数"),

  /*
   * FN012("FN012", "产品已经过了预约期")
   */
  FN012("FN012", "产品已经过了预约期"),

  /*
   * FN013("FN013", "更改产品参数表错误")
   */
  FN013("FN013", "更改产品参数表错误"),

  /*
   * FN014("FN014", "查询产品参数配置表出错")
   */
  FN014("FN014", "查询产品参数配置表出错"),

  /*
   * FN015("FN015", "查询参数库表出错")
   */
  FN015("FN015", "查询参数库表出错"),

  /*
   * FN016("FN016", "参数库不存在该参数")
   */
  FN016("FN016", "参数库不存在该参数"),

  /*
   * FN017("FN017", "插入产品参数配置表错误")
   */
  FN017("FN017", "插入产品参数配置表错误"),

  /*
   * FN018("FN018", "产品类型获取错误")
   */
  FN018("FN018", "产品类型获取错误"),

  /*
   * FN019("FN019", "已签约该产品的互斥产品")
   */
  FN019("FN019", "已签约该产品的互斥产品"),

  /*
   * FN020("FN020", "签约比例不合法")
   */
  FN020("FN020", "签约比例不合法"),

  /*
   * FN021("FN021", "计算客户收益错误")
   */
  FN021("FN021", "计算客户收益错误"),

  /*
   * FN022("FN022", "该账户为签约账户")
   */
  FN022("FN022", "该账户为签约账户"),

  /*
   * FN023("FN023", "已签约该产品")
   */
  FN023("FN023", "已签约该产品"),

  /*
   * FN024("FN024", "该产品未上架")
   */
  FN024("FN024", "该产品未上架"),

  /*
   * FN025("FN025", "该产品已下架")
   */
  FN025("FN025", "该产品已下架"),

  /*
   * FN026("FN026", "该产品处于锁定期,不可购买")
   */
  FN026("FN026", "该产品处于锁定期,不可购买"),

  /*
   * FN027("FN027", "该级别不可购买此产品")
   */
  FN027("FN027", "该级别不可购买此产品"),

  /*
   * FN028("FN028", "该产品不支持赎回")
   */
  FN028("FN028", "该产品不支持赎回"),

  /*
   * FN029("FN029", "赎回金额必须是个人赎回单位金额的整数倍")
   */
  FN029("FN029", "赎回金额必须是个人赎回单位金额的整数倍"),

  /*
   * FN030("FN030", "赎回金额必须大于个人最小赎回金额")
   */
  FN030("FN030", "赎回金额必须大于个人最小赎回金额"),

  /*
   * FN031("FN031", "赎回金额必须小于个人最大赎回金额")
   */
  FN031("FN031", "赎回金额必须小于个人最大赎回金额"),

  /*
   * FN032("FN032", "该产品不支持赎回")
   */
  FN032("FN032", "该产品不支持赎回"),

  /*
   * FN033("FN033", "发售总金额为空")
   */
  FN033("FN033", "发售总金额为空"),

  /*
   * FN034("FN034", "已售总金额大于发售总金额")
   */
  FN034("FN034", "已售总金额大于发售总金额"),

  /*
   * FN035("FN035", "没有设置理财产品状态")
   */
  FN035("FN035", "没有设置理财产品状态"),

  /*
   * FN036("FN036", "没有设置募集结束日期")
   */
  FN036("FN036", "没有设置募集结束日期"),

  /*
   * FN037("FN037", "产品募集期没有结束")
   */
  FN037("FN037", "产品募集期没有结束"),

  /*
   * FN038("FN038", "该产品状态不符")
   */
  FN038("FN038", "该产品状态不符"),

  /*
   * FN039("FN039", "赎回后剩余金额必须是个人单位认购金额的整数倍")
   */
  FN039("FN039", "赎回后剩余金额必须是个人单位认购金额的整数倍"),

  /*
   * FN040("FN040", "赎回后剩余金额必须大于个人最小认购金额")
   */
  FN040("FN040", "赎回后剩余金额必须大于个人最小认购金额"),

  /*
   * FN041("FN041", "赎回后剩余金额必须大于个人最小申购金额")
   */
  FN041("FN041", "赎回后剩余金额必须大于个人最小申购金额"),

  /*
   * FN042("FN042", "余额不足")
   */
  FN042("FN042", "余额不足"),

  /*
   * FN043("FN043", "赎回金额必须是对公人赎回单位金额的整数倍")
   */
  FN043("FN043", "赎回金额必须是对公人赎回单位金额的整数倍"),

  /*
   * FN044("FN044", "赎回金额必须大于对公最小赎回金额")
   */
  FN044("FN044", "赎回金额必须大于对公最小赎回金额"),

  /*
   * FN045("FN045", "赎回金额必须小于对公最大赎回金额")
   */
  FN045("FN045", "赎回金额必须小于对公最大赎回金额"),

  /*
   * FN046("FN046", "产品已过期")
   */
  FN046("FN046", "产品已过期"),

  /*
   * FN047("FN047", "开放日不允许赎回")
   */
  FN047("FN047", "开放日不允许赎回"),

  /*
   * FN048("FN048", "非赎回营业时间")
   */
  FN048("FN048", "非赎回营业时间"),

  /*
   * FN049("FN049", "赎回撤销标志未开启")
   */
  FN049("FN049", "赎回撤销标志未开启"),

  /*
   * FN050("FN050", "未能获取到相应的活期产品")
   */
  FN050("FN050", "未能获取到相应的活期产品"),

  /*
   * FN051("FN051", "非募集日期")
   */
  FN051("FN051", "非募集日期"),

  /*
   * FN052("FN052", "认购金额必须是个人认购单位金额的整数倍")
   */
  FN052("FN052", "认购金额必须是个人认购单位金额的整数倍"),

  /*
   * FN053("FN053", "不能大于最大认购金额")
   */
  FN053("FN053", "不能大于最大认购金额"),

  /*
   * FN054("FN054", "不能小于最小认购金额")
   */
  FN054("FN054", "不能小于最小认购金额"),

  /*
   * FN055("FN055", "非产品出售时间")
   */
  FN055("FN055", "非产品出售时间"),

  /*
   * FN056("FN056", "申购未开放")
   */
  FN056("FN056", "申购未开放"),

  /*
   * FN057("FN057", "非产品开放日期")
   */
  FN057("FN057", "非产品开放日期"),

  /*
   * FN058("FN058", "开放日不允许申购")
   */
  FN058("FN058", "开放日不允许申购"),

  /*
   * FN059("FN059", "不能大于最大申购金额")
   */
  FN059("FN059", "不能大于最大申购金额"),

  /*
   * FN060("FN060", "不能小于最小申购金额")
   */
  FN060("FN060", "不能小于最小申购金额"),

  /*
   * FN061("FN061", "没有设置募集开始日期")
   */
  FN061("FN061", "没有设置募集开始日期"),

  /*
   * FN062("FN062", "没有设置产品成立日期")
   */
  FN062("FN062", "没有设置产品成立日期"),

  /*
   * FN063("FN063", "该产品不支持认购撤销")
   */
  FN063("FN063", "该产品不支持认购撤销"),

  /*
   * FN064("FN064", "该产品不支持申购撤销")
   */
  FN064("FN064", "该产品不支持申购撤销"),

  /*
   * FN065("FN065", "产品核算配置不存在")
   */
  FN065("FN065", "产品核算配置不存在"),

  /*
   * FN066("FN066", "产品限制参数不存在")
   */
  FN066("FN066", "产品限制参数不存在"),

  /*
   * FN067("FN067", "卡券产品参数配置错误")
   */
  FN067("FN067", "卡券产品参数配置错误"),

  /*
   * FN068("FN068", "没有设置红包结束日期")
   */
  FN068("FN068", "没有设置红包结束日期"),

  /*
   * FN069("FN069", "没有设置红包最大在途时间")
   */
  FN069("FN069", "没有设置红包最大在途时间"),

  /*
   * FN070("FN070", "心愿分期存储金额总额不足目标金额")
   */
  FN070("FN070", "心愿分期存储金额总额不足目标金额"),

  /*
   * FN071("FN071", "该账号未签约或已解约该协议签约心愿")
   */
  FN071("FN071", "该账号未签约或已解约该协议签约心愿"),

  /*
   * FN072("FN072", "评论类型传入错误")
   */
  FN072("FN072", "评论类型传入错误"),

  /*
   * FN073("FN073", "客户号和产品编号只能选其一")
   */
  FN073("FN073", "客户号和产品编号只能选其一"),

  /*
   * FN074("FN074", "客户号和产品编号不能同时为空")
   */
  FN074("FN074", "客户号和产品编号不能同时为空"),

  /*
   * FN075("FN075", "不存在这条评论")
   */
  FN075("FN075", "不存在这条评论"),

  /*
   * FN076("FN076", "修改心愿储蓄类型失败")
   */
  FN076("FN076", "修改心愿储蓄类型失败"),

  /*
   * FN077("FN077", "新增心愿储蓄类型失败")
   */
  FN077("FN077", "新增心愿储蓄类型失败"),

  /*
   * FN078("FN078", "查询心愿储蓄类型失败")
   */
  FN078("FN078", "查询心愿储蓄类型失败"),

  /*
   * FN079("FN079", "注销心愿储蓄类型失败")
   */
  FN079("FN079", "注销心愿储蓄类型失败"),

  /*
   * FN080("FN080", "修改目标金额必须大于已储蓄金额")
   */
  FN080("FN080", "修改目标金额必须大于已储蓄金额"),
  /*
   * FN081("FN080", "安全策略号不存在")
   */
   FN081("FN081", "安全策略号不存在"),
   /*
    * FN082("FN082", "交易信息不存在")
    */
   FN082("FN082", "交易信息不存在"),
   /*
    * FN083("FN083", "验证安全信息错误")
    */
   FN083("FN083", "验证安全信息错误"),
   /**
    * FN084("FN084", "安全策略还未检查完")
    */
   FN084("FN084", "安全策略已使用过"),
   /**
    * FN085("FN085", "安全检查失败，请重新进行验证")
    */
   FN085("FN085", "安全检查失败，请重新进行验证"),
  /*
   * IF001("IF001", "未查到该笔理财账户")
   */
  IF001("IF001", "未查到该笔理财账户"),

  /*
   * IF002("IF002", "文件没有找到")
   */
  IF002("IF002", "文件没有找到"),

  /*
   * IF003("IF003", "读写文件失败")
   */
  IF003("IF003", "读写文件失败"),

  /*
   * IF004("IF004", "文件上传失败")
   */
  IF004("IF004", "文件上传失败"),

  /*
   * IF005("IF005", "无需要处理的预约记录")
   */
  IF005("IF005", "无需要处理的预约记录"),

  /*
   * IF006("IF006", "获取文件内容为空")
   */
  IF006("IF006", "获取文件内容为空"),

  /*
   * IF007("IF007", "无此赎回记录")
   */
  IF007("IF007", "无此赎回记录"),

  /*
   * IF008("IF008", "无符合条件的帐号")
   */
  IF008("IF008", "无符合条件的帐号"),

  /*
   * IF009("IF009", "购买撤销失败")
   */
  IF009("IF009", "购买撤销失败"),

  /*
   * IF010("IF010", "取消撤销失败")
   */
  IF010("IF010", "取消撤销失败"),

  /*
   * IF011("IF011", "购买登记失败")
   */
  IF011("IF011", "购买登记失败"),

  /*
   * IF012("IF012", "登记理财主表失败")
   */
  IF012("IF012", "登记理财主表失败"),

  /*
   * IF013("IF013", "登记理财明细失败")
   */
  IF013("IF013", "登记理财明细失败"),

  /*
   * IF014("IF014", "未知的购买类型")
   */
  IF014("IF014", "未知的购买类型"),

  /*
   * IF015("IF015", "该笔理财已撤销")
   */
  IF015("IF015", "该笔理财已撤销"),

  /*
   * IF016("IF016", "该笔理财已入账无法撤销")
   */
  IF016("IF016", "该笔理财已入账无法撤销"),

  /*
   * IF017("IF017", "协议号不能为空")
   */
  IF017("IF017", "协议号不能为空"),

  /*
   * IF018("IF018", "理财账户不存在")
   */
  IF018("IF018", "理财账户不存在"),

  /*
   * IF019("IF019", "理财转让申请撤销失败")
   */
  IF019("IF019", "理财转让申请撤销失败"),

  /*
   * IF020("IF020", "理财产品购买失败")
   */
  IF020("IF020", "理财产品购买失败"),

  /*
   * IF021("IF021", "查无此购买记录")
   */
  IF021("IF021", "查无此购买记录"),

  /*
   * IF022("IF022", "赎回撤销失败")
   */
  IF022("IF022", "赎回撤销失败"),

  /*
   * IF023("IF023", "当前可赎回金额超出账户总额")
   */
  IF023("IF023", "当前可赎回金额超出账户总额"),

  /*
   * IF024("IF024", "客户理财产品处于冻结状态")
   */
  IF024("IF024", "客户理财产品处于冻结状态"),

  /*
   * IF025("IF025", "剩余可用金额不足")
   */
  IF025("IF025", "剩余可用金额不足"),

  /*
   * IF026("IF026", "查询理财记录不存在")
   */
  IF026("IF026", "查询理财记录不存在"),

  /*
   * IF027("IF027", "客户信息不存在")
   */
  IF027("IF027", "客户信息不存在"),

  /*
   * IF028("IF028", "客户已解约或状态异常")
   */
  IF028("IF028", "客户已解约或状态异常"),

  /*
   * IF029("IF029", "无登记数据")
   */
  IF029("IF029", "无登记数据"),

  /*
   * IF030("IF030", "登记业务流水失败")
   */
  IF030("IF030", "登记业务流水失败"),

  /*
   * IF031("IF031", "无此流水记录")
   */
  IF031("IF031", "无此流水记录"),

  /*
   * IF032("IF032", "转让记录不存在")
   */
  IF032("IF032", "转让记录不存在"),

  /*
   * IF033("IF033", "获取核心账号失败")
   */
  IF033("IF033", "获取核心账号失败"),

  /*
   * IF034("IF034", "准备核心数据失败")
   */
  IF034("IF034", "准备核心数据失败"),

  /*
   * IF035("IF035", "修改认购/申购限额失败")
   */
  IF035("IF035", "修改认购/申购限额失败"),

  /*
   * IF036("IF036", "未找到核心产品号对应的互金产品")
   */
  IF036("IF036", "未找到核心产品号对应的互金产品"),

  /*
   * IF037("IF037", "维护理财账户关系失败")
   */
  IF037("IF037", "维护理财账户关系失败"),

  /*
   * IF999("IF999", "交易失败,理财异常登记成功")
   */
  IF999("IF999", "交易失败,理财异常登记成功"),

  /*
   * MD001("MD001", "介质代码不存在")
   */
  MD001("MD001", "介质代码不存在"),

  /*
   * MD002("MD002", "查询介质与账户关系表出错")
   */
  MD002("MD002", "查询介质与账户关系表出错"),

  /*
   * MD003("MD003", "不存在该账户")
   */
  MD003("MD003", "不存在该账户"),

  /*
   * MD004("MD004", "转账账户与转入账户不符")
   */
  MD004("MD004", "转账账户与转入账户不符"),

  /*
   * MD005("MD005", "查询介质属性表出错")
   */
  MD005("MD005", "查询介质属性表出错"),

  /*
   * MD006("MD006", "介质属性表多账户标志出错")
   */
  MD006("MD006", "介质属性表多账户标志出错"),

  /*
   * MD007("MD007", "登记介质账户关系表出错")
   */
  MD007("MD007", "登记介质账户关系表出错"),

  /*
   * MD008("MD008", "该介质已挂失")
   */
  MD008("MD008", "该介质已挂失"),

  /*
   * MD009("MD009", "该介质已挂失换证")
   */
  MD009("MD009", "该介质已挂失换证"),

  /*
   * MD010("MD010", "该介质已正常换证")
   */
  MD010("MD010", "该介质已正常换证"),

  /*
   * MD011("MD011", "该介质已销户")
   */
  MD011("MD011", "该介质已销户"),

  /*
   * MD012("MD012", "该介质已做部提，请输入新帐号")
   */
  MD012("MD012", "该介质已做部提，请输入新帐号"),

  /*
   * MD013("MD013", "该账户状态未激活，请充值激活")
   */
  MD013("MD013", "该账户状态未激活，请充值激活"),

  /*
   * MD014("MD014", "证件验证错误")
   */
  MD014("MD014", "证件验证错误"),

  /*
   * MD015("MD015", "证件信息获取失败")
   */
  MD015("MD015", "证件信息获取失败"),

  /*
   * MD016("MD016", "收支类型不存在")
   */
  MD016("MD016", "收支类型不存在"),

  /*
   * MD017("MD017", "该卡号未绑定电子账号")
   */
  MD017("MD017", "该卡号未绑定电子账号"),

  /*
   * MD018("MD018", "多账户介质标志错误")
   */
  MD018("MD018", "多账户介质标志错误"),

  /*
   * MD019("MD019", "重新设置登陆密码失败")
   */
  MD019("MD019", "重新设置登陆密码失败"),

  /*
   * MK001("MK001", "该关系不存在")
   */
  MK001("MK001", "该关系不存在"),

  /*
   * MK002("MK002", "该关系已存在")
   */
  MK002("MK002", "该关系已存在"),

  /*
   * MK003("MK003", "未找到符合条件账号")
   */
  MK003("MK003", "未找到符合条件账号"),

  /*
   * MK004("MK004", "生成活动编号失败")
   */
  MK004("MK004", "生成活动编号失败"),

  /*
   * MK005("MK005", "该活动已结束")
   */
  MK005("MK005", "该活动已结束"),

  /*
   * MK006("MK006", "该活动非登记或待审核状态")
   */
  MK006("MK006", "该活动非登记或待审核状态"),

  /*
   * MK007("MK007", "审核流程异常")
   */
  MK007("MK007", "审核流程异常"),

  /*
   * MK008("MK008", "该活动不存在")
   */
  MK008("MK008", "该活动不存在"),

  /*
   * MK009("MK009", "该封顶类型下数据已存在")
   */
  MK009("MK009", "该封顶类型下数据已存在"),

  /*
   * MK010("MK010", "该封顶不存在")
   */
  MK010("MK010", "该封顶不存在"),

  /*
   * MK011("MK011", "活动计划编号重复")
   */
  MK011("MK011", "活动计划编号重复"),

  /*
   * MK012("MK012", "该活动计划不存在")
   */
  MK012("MK012", "该活动计划不存在"),

  /*
   * MK013("MK013", "该活动执行规则不存在")
   */
  MK013("MK013", "该活动执行规则不存在"),

  /*
   * MK014("MK014", "计划编号传入格式错误")
   */
  MK014("MK014", "计划编号传入格式错误"),

  /*
   * MK015("MK015", "没有符合条件的活动计划")
   */
  MK015("MK015", "没有符合条件的活动计划"),

  /*
   * MK016("MK016", "更新计划优先级失败")
   */
  MK016("MK016", "更新计划优先级失败"),

  /*
   * MK017("MK017", "创建编号失败")
   */
  MK017("MK017", "创建编号失败"),

  /*
   * MK018("MK018", "登记交易流水失败")
   */
  MK018("MK018", "登记交易流水失败"),

  /*
   * MK019("MK019", "客户活动排名批量处理失败")
   */
  MK019("MK019", "客户活动排名批量处理失败"),

  /*
   * MK020("MK020", "已存在相同编号序号数据")
   */
  MK020("MK020", "已存在相同编号序号数据"),

  /*
   * MK021("MK021", "编号和序号不能为空")
   */
  MK021("MK021", "编号和序号不能为空"),

  /*
   * MK022("MK022", "该编号序号数据不存在")
   */
  MK022("MK022", "该编号序号数据不存在"),

  /*
   * MK023("MK023", "该使用规则已存在")
   */
  MK023("MK023", "该使用规则已存在"),

  /*
   * MK024("MK024", "获取核算账号失败")
   */
  MK024("MK024", "获取核算账号失败"),

  /*
   * MK025("MK025", "卡券不存在")
   */
  MK025("MK025", "卡券不存在"),

  /*
   * MK026("MK026", "卡券与使用账号不匹配")
   */
  MK026("MK026", "卡券与使用账号不匹配"),

  /*
   * MK027("MK027", "卡券已过期")
   */
  MK027("MK027", "卡券已过期"),

  /*
   * MK028("MK028", "卡券状态异常")
   */
  MK028("MK028", "卡券状态异常"),

  /*
   * MK029("MK029", "卡券未生效")
   */
  MK029("MK029", "卡券未生效"),

  /*
   * MK030("MK030", "拥有卡券数量已达上限")
   */
  MK030("MK030", "拥有卡券数量已达上限"),

  /*
   * MK031("MK031", "金额、折扣比例只能设置一个")
   */
  MK031("MK031", "金额、折扣比例只能设置一个"),

  /*
   * MK032("MK032", "计算金额失败")
   */
  MK032("MK032", "计算金额失败"),

  /*
   * MK033("MK033", "拥有卡券合计金额已达到上限")
   */
  MK033("MK033", "拥有卡券合计金额已达到上限"),

  /*
   * MK034("MK034", "折扣计算失败")
   */
  MK034("MK034", "折扣计算失败"),

  /*
   * MK035("MK035", "封顶校验失败")
   */
  MK035("MK035", "封顶校验失败"),

  /*
   * MK036("MK036", "查询最大卡券编号失败")
   */
  MK036("MK036", "查询最大卡券编号失败"),

  /*
   * MK037("MK037", "该卡券不可转赠")
   */
  MK037("MK037", "该卡券不可转赠"),

  /*
   * MK038("MK038", "实际抵扣金额与卡券无法对应")
   */
  MK038("MK038", "实际抵扣金额与卡券无法对应"),

  /*
   * MK039("MK039", "没有需要处理的过期卡券")
   */
  MK039("MK039", "没有需要处理的过期卡券"),

  /*
   * MK040("MK040", "更新卡券状态失败")
   */
  MK040("MK040", "更新卡券状态失败"),

  /*
   * MK041("MK041", "插入明细失败")
   */
  MK041("MK041", "插入明细失败"),

  /*
   * MK042("MK042", "积分更新失败")
   */
  MK042("MK042", "积分更新失败"),

  /*
   * MK043("MK043", "该数据不存在")
   */
  MK043("MK043", "该数据不存在"),

  /*
   * MK044("MK044", "机构编码不存在")
   */
  MK044("MK044", "机构编码不存在"),

  /*
   * MK045("MK045", "未找到符合条件的赠送规则")
   */
  MK045("MK045", "未找到符合条件的赠送规则"),

  /*
   * MK046("MK046", "机构编码已存在")
   */
  MK046("MK046", "机构编码已存在"),

  /*
   * MK047("MK047", "该机构联系人已存在")
   */
  MK047("MK047", "该机构联系人已存在"),

  /*
   * MK048("MK048", "联系人编号不存在")
   */
  MK048("MK048", "联系人编号不存在"),

  /*
   * MK049("MK049", "未找到符合条件的产品编号")
   */
  MK049("MK049", "未找到符合条件的产品编号"),

  /*
   * MK050("MK050", "代理机构登记编号已存在")
   */
  MK050("MK050", "代理机构登记编号已存在"),

  /*
   * MK051("MK051", "代理机构登记编号不存在")
   */
  MK051("MK051", "代理机构登记编号不存在"),

  /*
   * MK052("MK052", "该规则码不存在")
   */
  MK052("MK052", "该规则码不存在"),

  /*
   * MK053("MK053", "交易代码已存在")
   */
  MK053("MK053", "交易代码已存在"),

  /*
   * MK054("MK054", "交易代码不存在")
   */
  MK054("MK054", "交易代码不存在"),

  /*
   * MK055("MK055", "帐号积分不足")
   */
  MK055("MK055", "帐号积分不足"),

  /*
   * MK056("MK056", "收发类型为空")
   */
  MK056("MK056", "收发类型为空"),

  /*
   * MK057("MK057", "该收支类型下数据已存在")
   */
  MK057("MK057", "该收支类型下数据已存在"),

  /*
   * MK058("MK058", "限额编号不存在")
   */
  MK058("MK058", "限额编号不存在"),

  /*
   * MK059("MK059", "账单客户为空")
   */
  MK059("MK059", "账单客户为空"),

  /*
   * MK060("MK060", "账单明细笔数为空")
   */
  MK060("MK060", "账单明细笔数为空"),

  /*
   * MK061("MK061", "所传积分不能大于客户所拥有的积分")
   */
  MK061("MK061", "所传积分不能大于客户所拥有的积分"),

  /*
   * MK062("MK062", "登记红包交易失败")
   */
  MK062("MK062", "登记红包交易失败"),

  /*
   * MK063("MK063", "交易额度不能小于起始额度")
   */
  MK063("MK063", "交易额度不能小于起始额度"),

  /*
   * MK064("MK064", "计算抵扣金额失败")
   */
  MK064("MK064", "计算抵扣金额失败"),

  /*
   * MK065("MK065", "活动未开始")
   */
  MK065("MK065", "活动未开始"),

  /*
   * MK066("MK066", "获取抵扣规则的最大百分比失败")
   */
  MK066("MK066", "获取抵扣规则的最大百分比失败"),

  /*
   * MK067("MK067", "活动状态异常")
   */
  MK067("MK067", "活动状态异常"),

  /*
   * MK068("MK068", "没有配置封顶优先级")
   */
  MK068("MK068", "没有配置封顶优先级"),

  /*
   * MK069("MK069", "获取当日金额失败")
   */
  MK069("MK069", "获取当日金额失败"),

  /*
   * MK070("MK070", "获取当日笔数失败")
   */
  MK070("MK070", "获取当日笔数失败"),

  /*
   * MK071("MK071", "使用时间异常")
   */
  MK071("MK071", "使用时间异常"),

  /*
   * MK072("MK072", "使用规则不能为空")
   */
  MK072("MK072", "使用规则不能为空"),

  /*
   * MK073("MK073", "登记簿失败")
   */
  MK073("MK073", "登记簿失败"),

  /*
   * MK074("MK074", "编码不能为空")
   */
  MK074("MK074", "编码不能为空"),

  /*
   * MK075("MK075", "红包个数超过设置最大数量")
   */
  MK075("MK075", "红包个数超过设置最大数量"),

  /*
   * MK076("MK076", "红包金额小于最小金额")
   */
  MK076("MK076", "红包金额小于最小金额"),

  /*
   * MK077("MK077", "红包金额大于最大金额")
   */
  MK077("MK077", "红包金额大于最大金额"),

  /*
   * MK078("MK078", "获取客户名称失败")
   */
  MK078("MK078", "获取客户名称失败"),

  /*
   * MK079("MK079", "获取红包交易记录失败")
   */
  MK079("MK079", "获取红包交易记录失败"),

  /*
   * MK080("MK080", "所传虚拟币不能大于客户所拥有的虚拟币")
   */
  MK080("MK080", "所传虚拟币不能大于客户所拥有的虚拟币"),

  /*
   * MK081("MK081", "领取红包失败")
   */
  MK081("MK081", "领取红包失败"),

  /*
   * MK082("MK082", "没有配置寓意代码")
   */
  MK082("MK082", "没有配置寓意代码"),

  /*
   * MK083("MK083", "没有配置随机规则代码")
   */
  MK083("MK083", "没有配置随机规则代码"),

  /*
   * MK084("MK084", "已领取过该红包")
   */
  MK084("MK084", "已领取过该红包"),

  /*
   * MK085("MK085", "电子账号为空")
   */
  MK085("MK085", "电子账号为空"),

  /*
   * MK086("MK086", "该核算类型已存在")
   */
  MK086("MK086", "该核算类型已存在"),

  /*
   * MK087("MK087", "获取核算序号失败")
   */
  MK087("MK087", "获取核算序号失败"),

  /*
   * MK088("MK088", "红包状态异常")
   */
  MK088("MK088", "红包状态异常"),

  /*
   * MK089("MK089", "红包非可领取状态")
   */
  MK089("MK089", "红包非可领取状态"),

  /*
   * MK090("MK090", "红包已领完")
   */
  MK090("MK090", "红包已领完"),

  /*
   * MK091("MK091", "未定义的红包类型")
   */
  MK091("MK091", "未定义的红包类型"),

  /*
   * MK092("MK092", "领取金额与总金额不符")
   */
  MK092("MK092", "领取金额与总金额不符"),

  /*
   * MK093("MK093", "领取数量与总数量不符")
   */
  MK093("MK093", "领取数量与总数量不符"),

  /*
   * MK094("MK094", "该规则不存在")
   */
  MK094("MK094", "该规则不存在"),

  /*
   * MK095("MK095", "超过日限额")
   */
  MK095("MK095", "超过日限额"),

  /*
   * MK096("MK096", "超过月限额")
   */
  MK096("MK096", "超过月限额"),

  /*
   * MK097("MK097", "超过年限额")
   */
  MK097("MK097", "超过年限额"),

  /*
   * MK098("MK098", "红包限额配置错误")
   */
  MK098("MK098", "红包限额配置错误"),

  /*
   * MK099("MK099", "帐号虚拟币不足")
   */
  MK099("MK099", "帐号虚拟币不足"),

  /*
   * MK100("MK100", "红包撤销失败")
   */
  MK100("MK100", "红包撤销失败"),

  /*
   * MK101("MK101", "获取接收红包账号失败")
   */
  MK101("MK101", "获取接收红包账号失败"),

  /*
   * MK102("MK102", "无红包发送记录")
   */
  MK102("MK102", "无红包发送记录"),

  /*
   * MK103("MK103", "建立文件失败")
   */
  MK103("MK103", "建立文件失败"),

  /*
   * MK104("MK104", "账户积分明细查询不存在")
   */
  MK104("MK104", "账户积分明细查询不存在"),

  /*
   * MK105("MK105", "收发标志不正确")
   */
  MK105("MK105", "收发标志不正确"),

  /*
   * MK106("MK106", "不可删除别人评论")
   */
  MK106("MK106", "不可删除别人评论"),

  /*
   * MK107("MK107", "已点过赞")
   */
  MK107("MK107", "已点过赞"),

  /*
   * MK108("MK108", "用户未曾点过赞")
   */
  MK108("MK108", "用户未曾点过赞"),

  /*
   * MK109("MK109", "公告内容转化失败")
   */
  MK109("MK109", "公告内容转化失败"),
  /*
   * MK110("MK110", "补助已领取")
   */
  MK110("MK110", "补助已领取"),
 
  /*
   * MS001("MS001", "该场景短信发送过于频繁")
   */
  MS001("MS001", "该场景短信发送过于频繁"),

  /*
   * MS002("MS002", "该手机号短信发送过于频繁")
   */
  MS002("MS002", "该手机号短信发送过于频繁"),
  
  /*
   * MS003("MS003", "该场景短信发送超过每日上限")
   */
  MS003("MS003", "该场景短信发送超过每日上限"),
  
  /*
   * MS004("MS004", "该手机号短信发送超过每日上限")
   */
  MS004("MS004", "该手机号短信发送超过每日上限"),
  
  /*
   * MS005("MS005", "  短信内容超过最大数限制")
   */
  MS005("MS005", "  短信内容超过最大数限制"),

  /**
   * MS006("MS006", "该手机号未签约"),
   */
  MS006("MS006", "该手机号未签约"),
  
  /*
   * OU001("OU001", "登记柜员操作日志失败")
   */
  OU001("OU001", "登记柜员操作日志失败"),

  /*
   * PD001("PD001", "账号和证件号必输其一")
   */
  PD001("PD001", "账号和证件号必输其一"),
  
  /*
   * PD002("PD002", "账户介质信息不存在")
   */
  PD002("PD002", "账户介质信息不存在"),
  
  /*
   * PD003("PD003", "账号不能为空")
   */
  PD003("PD003", "账号不能为空"),
  
  /*
   * PD004("PD004", "账户信息不存在")
   */
  PD004("PD004", "账户信息不存在"),
  
  /*
   * PL001("PL001", "该产品没有被点赞")
   */
  PL001("PL001", "该产品没有被点赞"),

  /*
   * PL002("PL002", "已经取消对该产品的赞")
   */
  PL002("PL002", "已经取消对该产品的赞"),

  /*
 * PL003("PL003", "受托账户与本金账户不符")
 */
  PL003("PL003", "受托账户与本金账户不符"),

  /*
   * PN001("PN001", "输入的手机号码不正确")
   */
  PN001("PN001", "输入的手机号码不正确"),
  
  /*
   * PN001("PN001", "输入的手机号码不正确")
   */
  PN002("PN002", "系统内测中，请耐心等待..."),

  /*
   * RA001("RA001", "金额，天数分段格式错误")
   */
  RA001("RA001", "金额，天数分段格式错误"),

  /*
   * RA002("RA002", "利率类型格式有误,或格式不匹配")
   */
  RA002("RA002", "利率类型格式有误,或格式不匹配"),

  /*
   * RA003("RA003", "传入利率类型格式有误")
   */
  RA003("RA003", "传入利率类型格式有误"),

  /*
   * RA004("RA004", "规则间关系处理标志不能为空")
   */
  RA004("RA004", "规则间关系处理标志不能为空"),

  /*
   * RA005("RA005", "规则间关系处理标志类型错误")
   */
  RA005("RA005", "规则间关系处理标志类型错误"),

  /*
   * RA006("RA006", "浮动方式格式错误")
   */
  RA006("RA006", "浮动方式格式错误"),

  /*
   * RA007("RA007", "获取语句与获取方式不匹配")
   */
  RA007("RA007", "获取语句与获取方式不匹配"),

  /*
   * RA008("RA008", "调用值与函数中的值个数不匹配")
   */
  RA008("RA008", "调用值与函数中的值个数不匹配"),

  /*
   * RA009("RA009", "维度关键字数据类型不匹配")
   */
  RA009("RA009", "维度关键字数据类型不匹配"),

  /*
   * RA010("RA010", "纬度映射获取方式类型有误")
   */
  RA010("RA010", "纬度映射获取方式类型有误"),

  /*
   * RA011("RA011", "规则间关系处理标志有误")
   */
  RA011("RA011", "规则间关系处理标志有误"),

  /*
   * RA012("RA012", "没有符合此规则的产品利率，请查看是否配正确")
   */
  RA012("RA012", "没有符合此规则的产品利率，请查看是否配正确"),

  /*
   * RA013("RA013", "产品利率编码不能为空")
   */
  RA013("RA013", "产品利率编码不能为空"),

  /*
   * RA014("RA014", "到期标志不能为空")
   */
  RA014("RA014", "到期标志不能为空"),

  /*
   * RA015("RA015", "利率类型不能为空")
   */
  RA015("RA015", "利率类型不能为空"),

  /*
   * RA016("RA016", "使用系统不能为空")
   */
  RA016("RA016", "使用系统不能为空"),

  /*
   * RA017("RA017", "开户日期不能为空")
   */
  RA017("RA017", "开户日期不能为空"),

  /*
   * RA018("RA018", "利率分段规则编码不能为空")
   */
  RA018("RA018", "利率分段规则编码不能为空"),

  /*
   * RA019("RA019", "计算利率错误")
   */
  RA019("RA019", "计算利率错误"),

  /*
   * RA020("RA020", "插入结息登记簿错误")
   */
  RA020("RA020", "插入结息登记簿错误"),

  /*
   * RA021("RA021", "插入结息明细登记簿错误")
   */
  RA021("RA021", "插入结息明细登记簿错误"),

  /*
   * RA022("RA022", "此产品已逾期，不允许部提操作")
   */
  RA022("RA022", "此产品已逾期，不允许部提操作"),

  /*
   * RA023("RA023", "增加基础利率错误")
   */
  RA023("RA023", "增加基础利率错误"),

  /*
   * RA024("RA024", "修改基础利率错误")
   */
  RA024("RA024", "修改基础利率错误"),

  /*
   * RA025("RA025", "增加维度定义错误")
   */
  RA025("RA025", "增加维度定义错误"),

  /*
   * RA026("RA026", "修改维度定义错误")
   */
  RA026("RA026", "修改维度定义错误"),

  /*
   * RA027("RA027", "增加利率税错误")
   */
  RA027("RA027", "增加利率税错误"),

  /*
   * RA028("RA028", "修改利率税错误")
   */
  RA028("RA028", "修改利率税错误"),

  /*
   * RA029("RA029", "查询结息登记簿为空")
   */
  RA029("RA029", "查询结息登记簿为空"),

  /*
   * RA030("RA030", "查询结息登记簿异常")
   */
  RA030("RA030", "查询结息登记簿异常"),

  /*
   * RA031("RA031", "符合条件的列表为空")
   */
  RA031("RA031", "符合条件的列表为空"),

  /*
   * SS001("SS001", "系统参数设置错误")
   */
  SS001("SS001", "系统参数设置错误"),

  /*
   * SS002("SS002", "系统参数格式化失败")
   */
  SS002("SS002", "系统参数格式化失败"),

  /*
   * SS003("SS003", "交易预设参数错误")
   */
  SS003("SS003", "交易预设参数错误"),

  /*
   * SS004("SS004", "传入初始化步骤的服务名不存在")
   */
  SS004("SS004", "传入初始化步骤的服务名不存在"),

  /*
   * SS005("SS005", "系统公共参数设置有误")
   */
  SS005("SS005", "系统公共参数设置有误"),

  /*
   * SS006("SS006", "渠道类型不能为空")
   */
  SS006("SS006", "渠道类型不能为空"),

  /*
   * SS007("SS007", "渠道流水号已经存在")
   */
  SS007("SS007", "渠道流水号已经存在"),

  /*
   * SS008("SS008", "渠道流水号不能为空")
   */
  SS008("SS008", "渠道流水号不能为空"),

  /*
   * SS009("SS009", "接收返回报文不存在")
   */
  SS009("SS009", "接收返回报文不存在"),

  /*
   * TC001("TC001", "指定key在交易上下文中不存在")
   */
  TC001("TC001", "指定key在交易上下文中不存在"),

  /*
   * TC002("TC002", "输入参数为空")
   */
  TC002("TC002", "输入参数为空"),

  /*
   * TC003("TC003", "数据类型转换失败")
   */
  TC003("TC003", "数据类型转换失败"),

  /*
   * TC004("TC004", "数据库插入失败")
   */
  TC004("TC004", "数据库插入失败"),

  /*
   * TC005("TC005", "获取日期格式错误")
   */
  TC005("TC005", "获取日期格式错误"),

  /*
   * TC006("TC006", "传入参数格式不正确")
   */
  TC006("TC006", "传入参数格式不正确"),

  /*
   * TC007("TC007", "随机码生成失败")
   */
  TC007("TC007", "随机码生成失败"),

  /*
   * TC008("TC008", "流水号长度大于12位")
   */
  TC008("TC008", "流水号长度大于12位"),

  /*
   * TC009("TC009", "密码控件注册表查询失败")
   */
  TC009("TC009", "密码控件注册表查询失败"),

  /*
   * TC010("TC010", "密码控件PWD_SEQ序列号获取失败")
   */
  TC010("TC010", "密码控件PWD_SEQ序列号获取失败"),

  /*
   * TC011("TC011", "生成的企业内管操作员编号为空")
   */
  TC011("TC011", "生成的企业内管操作员编号为空"),

  /*
   * TC012("TC012", "生成的客户登录日志表序号为空")
   */
  TC012("TC012", "生成的客户登录日志表序号为空"),

  /*
   * TC013("TC013", "系统控制参数表未设置")
   */
  TC013("TC013", "系统控制参数表未设置"),

  /*
   * TC014("TC014", "批量去空格失败")
   */
  TC014("TC014", "批量去空格失败"),

  /*
   * TC015("TC015", "密码MD5加密失败")
   */
  TC015("TC015", "密码MD5加密失败"),

  /*
   * TC016("TC016", "登记交易流水失败")
   */
  TC016("TC016", "登记交易流水失败"),

  /*
   * TC017("TC017", "获取新的交易流水号失败")
   */
  TC017("TC017", "获取新的交易流水号失败"),

  /*
   * TC018("TC018", "密码AESWithJCE处理失败，请检查传入值")
   */
  TC018("TC018", "密码AESWithJCE处理失败，请检查传入值"),

  /*
   * TC019("TC019", "编辑文件失败")
   */
  TC019("TC019", "编辑文件失败"),

  /*
   * TC020("TC020", "输入要素不完整")
   */
  TC020("TC020", "输入要素不完整"),

  /*
   * TC021("TC021", "获取柜员流水失败")
   */
  TC021("TC021", "获取柜员流水失败"),

  /*
   * TC022("TC022", "获取日期在所处月的第几天失败")
   */
  TC022("TC022", "获取日期在所处月的第几天失败"),

  /*
   * TC023("TC023", "文件上传失败")
   */
  TC023("TC023", "文件上传失败"),

  /*
   * TC024("TC024", "文件下载失败")
   */
  TC024("TC024", "文件下载失败"),

  /*
   * TC026("TC026", "数组元素为空")
   */
  TC026("TC026", "数组元素为空"),

  /*
   * TC027("TC027", "操作类型错误")
   */
  TC027("TC027", "操作类型错误"),

  /*
   * TC028("TC028", "删除文件失败")
   */
  TC028("TC028", "删除文件失败"),

  /*
   * TC029("TC029", "获取文件路径失败")
   */
  TC029("TC029", "获取文件路径失败"),

  /*
   * TC030("TC030", "解加密失败")
   */
  TC030("TC030", "解加密失败"),

  /*
   * TC031("TC031", "传入参数不对应")
   */
  TC031("TC031", "传入参数不对应"),

  /*
   * TC032("TC032", "传入参数有误")
   */
  TC032("TC032", "传入参数有误"),

  /*
   * TC033("TC033", "文件名获取失败")
   */
  TC033("TC033", "文件名获取失败"),

  /*
   * TC037("TC037", "通信异常"),
   */
  TC037("TC037", "通信异常"),
  /*
   * TC038("TC038", "通信超时"),
   */
  TC038("TC038", "通信超时"),
  /*
   * TC040("TC040", "Token验证非法"),
   */
  TC040("TC040", "Token验证非法"),
  /*
   * TC040("TC041", "Token验证非法"),
   */
  TC041("TC041", "验签失败"),
  /*
   * TC039("TC039", "生成TOKEN失败"),
   */
  TC039("TC039", "生成TOKEN失败"),
  
  /*
   * TC100("TC100", "请检查姓名，手机号，卡号 ，身份证号信息是否匹配")
   */
  TC100("TC100", "请检查姓名，手机号，卡号 ，身份证号信息是否匹配"),
  /*
   * TC101("TC101", "该客户未开本行二类户")
   */
  TC101("TC101", "该客户未开本行二类户"),
  /*
   * TC102("TC102", "银行卡格式验证错误")
   */
  TC102("TC102", "银行卡格式验证错误"),
  /*
   * TC103("TC103", "银行卡号卡bin判断失败")
   */
  TC103("TC103", "银行卡号卡bin判断失败"),
  /*
   * TC104("TC104", "支付交易状态查询失败")
   */
  TC104("TC104", "支付交易状态查询失败"),
  /*
   * TC105("TC105", "核心调用异常")
   */
  TC105("TC105", "核心调用异常"),
  /*
   * TC106("TC106", "返回数据为空")
   */
  TC106("TC106", "返回数据为空"),	
  /*
   * TC107("TC107", "返回数据为空")
   */
  TC107("TC107", "核心客户号，证件号码，证件类型不能同时为空"),
  /*
   * TC108("TC108", "返回数据为空")
   */
  TC108("TC108", "外部合作方查询内部合作方失败"),
  /*
   * TC109("TC109", "返回数据为空")
   */
  TC109("TC109", "产品查询出来的合作方与实体传进来的合作方不符"),
  /*
   * TC110("TC110", "返回数据为空")
   */
  TC110("TC110", "汇路查询失败，无可用汇路"),
  /*
   * TD001("TD001", "交易上下文中目标键值不存在")
   */
  TD001("TD001", "交易上下文中目标键值不存在"),

  /*
   * TD002("TD002", "当前交易中源上下文key不存在")
   */
  TD002("TD002", "当前交易中源上下文key不存在"),

  /*
   * TD003("TD003", "交易处理错误，请检查交易处理日志")
   */
  TD003("TD003", "交易处理错误，请检查交易处理日志"),

  /*
   * TD004("TD004", "回滚交易时间与日志提供日期不符")
   */
  TD004("TD004", "回滚交易时间与日志提供日期不符"),

  /*
   * TD006("TD006", "已回滚，无需继续回滚")
   */
  TD006("TD006", "已回滚，无需继续回滚"),

  /*
   * TD007("TD007", "已经审核，该状态无需回滚")
   */
  TD007("TD007", "已经审核，该状态无需回滚"),

  /*
   * TD009("TD009", "登记回滚失败")
   */
  TD009("TD009", "登记回滚失败"),

  /*
   * TD023("TD023", "回滚交易编码与日志提供交易编码不符")
   */
  TD023("TD023", "回滚交易编码与日志提供交易编码不符"),

  /*
   * TE001("TE001", "当前柜员已经停用")
   */
  TE001("TE001", "当前柜员已经停用"),

  /*
   * TE002("TE002", "当前柜员账号已失效或者不存在")
   */
  TE002("TE002", "当前柜员账号已失效或者不存在"),

  /*
   * TE003("TE003", "输入旧有密码错误")
   */
  TE003("TE003", "输入旧有密码错误"),

  /*
   * TE004("TE004", "更新密码失败")
   */
  TE004("TE004", "更新密码失败"),

  /*
   * TE005("TE005", "新增柜员时自动获取柜员登录账号序列失败！")
   */
  TE005("TE005", "新增柜员时自动获取柜员登录账号序列失败！"),

  /*
   * WC111("WC111", "错误码维护")
   */

  WC111("WC111", "错误码维护"),
  
  /*
   * WC112("WC112", "错误码类型不存在")
   */
  WC112("WC112", "错误码类型不存在"),
  
  /*
   * WC113("WC113", "错误码不存在")
   */
  WC113("WC113", "错误码不存在"),
  
  /*
   * BS008("BS008", "该笔记录已存在")
   */
  BS008("BS008", "该笔记录已存在"),

  /*
   * BS009("BS009", "存在关联数据未删除")
   */
  BS009("BS009", "存在关联数据未删除"),
  
  /*
   * BS010("BS010", "该笔记录不存在")
   */
  BS010("BS010", "该笔记录不存在"),
  
	/*
   * 与核心错误码映射，勿修改
   */
  RB001("RB001", "账户密码错误"),
  
  /*
   * 与核心错误码映射，勿修改
   */
  RB002("RB002", "密码已经被锁定"),
  /*
   *AG001("AG001","签名失败")
   */
  AG001("AG001","签名失败"),
  /*
   * AG002("AG002","验证签名失败")
   */
  AG002("AG002","验证签名失败"),
  /*
   * AG003("AG003","验签成功但证书验证失败")
   */
  AG003("AG003","验签成功但证书验证失败"),
  /*
   *  YZ001("YZ001","证书查询失败")
   */
  YZ001("YZ001","证书查询失败"),
  /*
   * YZ002("YZ002","吊销证书失败")
   */
  YZ002("YZ002","吊销证书失败"),
  /*
   * YZ003("YZ003","清空用户PIN码失败")
   */
  YZ003("YZ003","清空用户PIN码失败"),
  /*
   * SE999("SE999", "系统内部错误")
   */
  SE999("SE999", "系统内部错误"),
  /*
   * LN001("LN001", "姓名格式不正确")
   */
  LN001("LN001", "姓名格式不正确"),
  /*
   * LN002("LN002", "传入还款发卡行英文缩写与表配置发卡行英文缩写不一致")
   */
  LN002("LN002", "传入还款发卡行英文缩写与表配置发卡行英文缩写不一致"),
  /*
   * FM002("FM002", "合同总金额除以总期数不等于当次放款金额除以当次放款期数")
   */
  FM002("FM002", "传入还款发卡行英文缩写与表配置发卡行英文缩写不一致"),
  /*
   * LN003("LN003", "合同总金额除以总期数不等于当次放款金额除以当次放款期数")
   */
  LN003("LN003", "合同总金额除以总期数不等于当次放款金额除以当次放款期数"),
  /*
   * LN004("LN004", "该客户在黑名单中，拒绝贷款申请	")
   */
  LN004("LN004", "该客户在黑名单中，拒绝贷款申请	"),
  /*
   * LN005("LN005", "本次放款已用额度大于授信额度	")
   */
  LN005("LN005", "本次放款已用额度大于授信额度"),
  /*
   * LN006("LN006", "生成贷款合同失败")
   */
  LN006("LN006", "生成贷款合同失败"),
  /*
   * LN007("LN007", "还款金额大于剩余本金")
   */
  LN007("LN007", "提前还款本金金额大于剩余本金"),
  /*
   * LN008("LN008", "已存在信息")
   */
  LN008("LN008", "已存在欠款信息"),
  /*
   * LN009("LN009", "需要变更的银行卡和手机号不能和原来的一致")
   */
  LN009("LN009", "需要变更的银行卡和手机号不能和原来的一致"),
  /*
   * LN010("LN010", "信息已变更")
   */
  LN010("LN010", "信息已变更"),
  /*
   * LN011("LN011", "鉴权超时，请重新发起	")
   */
  LN011("LN011", "鉴权超时，请重新发起	"),
  /*
   * LN012("LN012", "已存在欠款信息")
   */
  LN012("LN012", "数据查询为空，请核对数据重新发起"),
  /*
   * LN013("LN013", "流水查询为空")
   */
  LN013("LN013", "流水查询为空"),
  /*
   * LN014("LN014", "本期已还，无需进行还款")
   */
  LN014("LN014", "本期欠款已还，无需进行还款"),
  /*
   * LN015("LN015", "贷款编号未登记")
   */
  LN015("LN015", "贷款编号未登记"),
  /*
   * LN016("LN016", "贷款编号与证件号不匹配")
   */
  LN016("LN016", "贷款编号与证件号不匹配"),
  /*
   * LN017("LN017", "还款金额与本期计划还款本金不相等")
   */
  LN017("LN017", "还款金额与本期计划还款本金不相等"),
  /*
   * LN018("LN018", "欠款信息查询失败")
   */
  LN018("LN018", "欠款信息查询失败"),
  /*
   * LN019("LN019", "提前出单还款失败	")
   */
  LN019("LN019", "提前出单还款失败"),
  /*
   * LN020("LN020", "欠款信息不存在")
   */
  LN020("LN020", "欠款信息不存在"),
  /*
   * LN021("LN021", "还款金额不能小于本期还款总金额")
   */
  LN021("LN021", "还款金额不能小于本期还款总金额"),
  /*
   * LN022("LN022", "无法识别的还款模式")
   */
  LN022("LN022", "无法识别的还款模式"),
  /*
   * LN023("LN023", "提前还款日期错误")
   */
  LN023("LN023", "提前还款日期错误"),
  /*
   * LN024("LN024", "准入检查不通过")
   */
  LN024("LN024", "准入检查不通过"),
  /*
   * LN025("LN025", "查询该账户有逾期未处理")
   */
  LN025("LN025", "查询该账户有逾期未处理"),
  /*
   * LN026("LN026", " 查询卡内余额不足")
   */
  LN026("LN026", " 查询卡内余额不足"),
  /*
   * LN027("LN027", "传入日期不在还款期限内")
   */
  LN027("LN027", "传入日期不在还款期限内"),
  /*
   * LN028("LN028", "核心放款异常")
   */
  LN028("LN028", "核心放款异常"),
  /*
   * LN029("LN029", "核心放款失败")
   */
  LN029("LN029", "核心放款失败"),
  /*
   * LN030("LN030", "核心转账失败")
   */
  LN030("LN030", "贷款转账失败"),	
  /*
   * LN031("LN031", "核心放款失败")
   */
  LN031("LN031", "核心放款失败"),
  /*
   * LN032("LN032", "逾期日期计算异常")
   */
  LN032("LN032", "逾期日期计算异常"),
  /*
   * LN033("LN033", "授信额度不能大于产品配置授信额度")
   */
  LN033("LN033", "授信额度不能大于产品配置授信额度"),
  /*
   * LN034("LN034", "无法识别的原交易接口名称")
   */
  LN034("LN034", "无法识别的原交易接口名称"),
  /*
   * LN035("LN035", "金额格式不正确")
   */
  LN035("LN035", "金额格式不正确"),
  /*
   * LN036("LN036", "期次格式不正确，只能是数字")
   */
  LN036("LN036", "期次格式不正确，只能是数字"),
  /*
   * LN037("LN037", "还款信息不存在")
   */
  LN037("LN037", "还款信息不存在"),
  /*
   * LN038("LN038", "还款已结清")
   */
  LN038("LN038", "还款已结清"),
  /*
   * LN039("LN039", "传入证件号码，银行卡号未通过认证或未启用")
   */
  LN039("LN039", "传入证件号码，银行卡号未通过认证或未启用"),
  /*
   * LN040("LN040", "期望放款日小于当前日期")
   */
  LN040("LN040", "期望放款日小于当前日期"),
  /*
   * LN041("LN041", "不支持的证件类型")
   */
  LN041("LN041", "不支持的证件类型"),
  /*
   * LN042("LN042", "申请次数超过系统控制最大次数")
   */
  LN042("LN042", "申请次数超过系统控制最大次数"),
  /*
   * LN043("LN043", "本次申请后额度大于单户申请限额")
   */
  LN043("LN043", "本次申请后额度大于单户申请限额"),
  /*
   * LN044("LN044", "借据号不存在")
   */
  LN044("LN044", "借据号不存在"),
  /*
   * LN045("LN045", "借据信息与身份信息不匹配！")
   */
  LN045("LN045", "借据信息与身份信息不匹配！"),
  /*
   * LN046("LN046", "查询还款计划报错！")
   */
  LN046("LN046", "查询还款计划报错！"),
  /*
   * LN047("LN047", "提前还款试算失败！")
   */
  LN047("LN047", "提前还款试算失败！"),
  /*
   * LN048("LN048", "系统中还款卡号不一致！")
   */
  LN048("LN048", "系统中还款卡号不一致！"),
  /*
   * LN049("LN049", "还款来源输入错误！")
   */
  LN049("LN049", "还款来源输入错误！"),
  /*
   * LN050("LN050", "参数交易类型错误")
   */
  LN050("LN050", "参数交易类型错误"),
  /*
   * LN051("LN051", "第三方流水号长度大于32位")
   */
  LN051("LN051", "第三方流水号长度大于32位"),
  /*
   * LN052("LN052", "银行卡鉴权无可用渠道")
   */
  LN052("LN052", "银行卡鉴权无可用渠道"),
  /*
   * LN053("LN053", "鉴权失败")
   */
  LN053("LN053", "鉴权失败"),
  /*
   * LN054("LN054", "还款账号不支持信用卡")
   */
  LN054("LN054", "还款账号不支持信用卡"),
  /*
   * LN055("LN055", "请先进行预授信")
   */
  LN055("LN055", "请先进行预授信"),
  /*
   * LN056("LN056", "请先进行授信")
   */
  LN056("LN056", "请先进行授信"),
  /*
   * LN057("LN057", "年利率不能小于授信利率")
   */
  LN057("LN057", "年利率不能小于授信利率"),
  /*
   * LN058("LN058", "还款方式跟授信还款方式不匹配")
   */
  LN058("LN058", "还款方式跟授信还款方式不匹配"),
  /*
   * LN059("LN059", "贷款期限跟授信期限不匹配")
   */
  LN059("LN059", "贷款期限跟授信期限不匹配"),
  /*
   * LN060("LN060", "车辆信息规则校验拒绝")
   */
  LN060("LN060", "车辆信息规则校验拒绝"),
  /*
   * LN061("LN061", "请款人代扣还款授权对象应为中关村银行")
   */
  LN061("LN061", "请款人代扣还款授权对象应为中关村银行"),
  /*
   * LN062("LN062", "首次还款日必须大于当前日期")
   */
  LN062("LN062", "首次还款日必须大于当前日期"),
  /*
   * LN063("LN063", "合作方砍头费比例不在[0,1)区间内")
   */
  LN063("LN063", "合作方砍头费比例不在[0,1)区间内"),
  /*
   * LN064("LN064", "放款金额大于合同金额")
   */
  LN064("LN064", "放款金额大于合同金额"),
  /*
   * LN065("LN065", "年利率不在(0,1)区间内")
   */
  LN065("LN065", "年利率不在(0,1)区间内"),
  /*
   * LN066("LN066", "传入收款账号发卡行英文缩写与表配置发卡行英文缩写不一致")
   */
  LN066("LN066", "传入收款账号发卡行英文缩写与表配置发卡行英文缩写不一致"),
  /*
   * LN067("LN067", "期望放款必须为当前日期")
   */
  LN067("LN067", "期望放款日必须为当前日期"),
  /*
   * LN068("LN068", "代扣标志错误")
   */
  LN068("LN068", "代扣标志错误"),
  /*
   * LN069("LN069", "验证码下发渠道错误")
   */
  LN069("LN069", "验证码下发渠道错误"),
  /*
   * LN070("LN070", "还款授权对象错误")
   */
  LN070("LN070", "还款授权对象错误"),
  /*
   * LN071("LN071", "受托支付标志错误")
   */
  LN071("LN071", "受托支付标志错误"),
  /*
   * LN072("LN072", "贷款到期日确定方式错误")
   */
  LN072("LN072", "贷款到期日确定方式错误"),
  /*
   * LN073("LN073", "贷款期限单位错误")
   */
  LN073("LN073", "贷款期限单位错误"),
  /*
   * LN074("LN074", "还款方式错误")
   */
  LN074("LN074", "还款方式错误"),
  /*
   * LN075("LN075", "是否贴息标志错误")
   */
  LN075("LN075", "是否贴息标志错误"),
  
  /*
   * LN076("LN076", "产品编号错误")
   */
  LN076("LN076", "产品编号错误"),
  
  /*
   * LN077("LN077", "合作方标识错误")
   */
  LN077("LN077", "合作方标识错误"),
  
  /*
   * LN078("LN078", "产品参数未维护")
   */
  LN078("LN078", "产品参数未维护"),
  
  /*
   * LN079("LN079", "预授信到期日不能小于系统日期")
   */
  LN079("LN079", "预授信到期日不能小于系统日期"),
  
  /*
   * LN080("LN080", "合同总额不能大于授信额度")
   */
  LN080("LN080", "合同总额不能大于授信额度"),
  /*
   * LN081("LN081", "非营业时间段")
   */
  LN081("LN081", "非营业时间段"),
  /*
   * LN082("LN082", "数据不符合检查规则")
   */
  LN082("LN082", "数据不符合检查规则"),
  /*
   * LN083("LN083", "额度不在允许范围内")
   */
  LN083("LN083", "额度不在允许范围内"),
  /*
   * LN084("LN084", "利率不在允许范围内")
   */
  LN084("LN084", "利率不在允许范围内"),
  /*
   * LN085("LN085", "期限不在允许范围内")
   */
  LN085("LN085", "期限不在允许范围内"),
  /*
   * LN086("LN086", "还款方式不在允许范围内")
   */
  LN086("LN086", "还款方式不在允许范围内"),
  /*
   * LN087("LN087", "还款单号长度不能大于32位")
   */
  LN087("LN087", "还款单号长度不能大于32位"),
  /*
   * LN088("LN088", "还款明细处理发生错误")
   */
  LN088("LN088", "还款明细处理发生错误"),
  /*
   * LN089("LN089", "还款明细错误")
   */
  LN089("LN089", "还款明细错误"),
  /*
   * LN090("LN090", "不允许隔期还款")
   */
  LN090("LN090", "不允许隔期还款"),
  /*
   * LN091("LN091", "还款金额与核心系统中不符，请参考提前还款试算的金额")
   */
  LN091("LN091", "还款金额与核心系统中不符，请参考提前还款试算的金额"),
  /*
   * LN092("LN092", "提前还款总金额不正确")
   */
  LN092("LN092", "提前还款总金额不正确"),
  /*
   * LN093("LN093", "合同信息不存在")
   */
  LN093("LN093", "合同信息不存在"),
  /*
   * LN094("LN094", "每页条数大于10！")
   */
  LN094("LN094", "每页条数大于10！"),
  /*
   * LN095("LN095", "法人贷款合同信息不存在！")
   */
  LN095("LN095", "法人贷款合同信息不存在！"),
  /*
   * LN096("LN096", "证件类型+证件号码与客户名称全部为空！")
   */
  LN096("LN096", "证件类型+证件号码与客户名称全部为空！"),
  /*
   * LN097("LN097", "贷款借据列表信息不存在！")
   */
  LN097("LN097", "贷款借据列表信息不存在！"),
  /*
   * LN100("LN100", "查询信息不存在")
   */
  LN100("LN100", "查询信息不存在"),
  /*
   * LN101("LN101", "账户余额不足")
   */
  LN101("LN101", "账户余额不足"),
  /*
   * LN102("LN102", "客户额度表信息不存在")
   */
  LN102("LN102", "客户额度表信息不存在"),
  /*
   * LN103("LN103", "超出客户额度")
   */
  LN103("LN103", "超出客户额度"),
  /*
   * LN104("LN104", "核心客户未开")
   */
  LN104("LN104", "核心客户未开"),
  /*
   * LN105("LN105", "担保合同信息为空")
   */
  LN105("LN105", "担保合同信息为空"),
  /*
   * LN106("LN106", "客户不在白名单")
   */
  LN106("LN106", "客户不在白名单"),
  /*
   * LN107("LN107", "还款试算日期小于系统日期")
   */
  LN107("LN107", "还款试算日期小于系统日期"),
  /*
   * LN108("LN108", "状态已失效")
   */
  LN108("LN108", "状态已失效"),
  /*
   * LN109("LN109", "贷款金额小于单笔贷款最小金额")
   */
  LN109("LN109", "贷款金额小于单笔贷款最小金额"),
  /*
   * LN110("LN110", "合同计划表计划状态不正确")
   */
  LN110("LN110", "合同计划表计划状态不正确"),
  /*
   * LN110("LN111", "账户不正确")
   */
  LN111("LN111", "账户不正确"),
  /*
   * LN112("LN112", "分页参数不正确")
   */
  LN112("LN112", "分页参数不正确"),
  /*
   * LN113("LN113", "合同期限不在最小期限和最大期限内")
   */
  LN113("LN113", "合同期限不在最小期限和最大期限内"),
  /*
   * LN114("LN114", "合同金额不能大于系统配置的最大金额")
   */
  LN114("LN114", "合同金额不能大于系统配置的最大金额"),
  /*
   * LN115("LN115", "金额不能小于0")
   */
  LN115("LN115", "金额不能小于0"),
  /*
   * LN116("LN116", "利率错误")
   */
  LN116("LN116", "利率错误"),
  /*
   * LN118("LN118", "获取客户额度失败")
   */
  LN118("LN118", "获取客户额度失败"),
  /*
   * LN119("LN119", "本日已放款")
   */
  LN119("LN119", "本日已放款"),
  /*
   * LN120("LN120", "合作方与产品不匹配")
   */
  LN120("LN120", "合作方与产品不匹配"),
  /*
   * LN121("LN121", "更新合作方文件输出控制表失败")
   */
  LN121("LN121", "更新合作方文件输出控制表失败"),
  /*
   * LN122("LN122", "获取上次生成文件日期后一天失败")
   */
  LN122("LN122", "获取上次生成文件日期后一天失败"),
  /*
   * LN123("LN123", "查询该合作方合同信息为空")
   */
  LN123("LN123", "查询该合作方合同信息为空"),
  /*
   * LN124("LN124", "还款明细为空")
   */
  LN124("LN124", "还款明细为空"),
  /*
   * LN125("LN125", "结算信息为空")
   */
  LN125("LN125", "结算信息为空"),
  /*
   * LN126("LN126", "不支持的还款账号类型")
   */
  LN126("LN126", "不支持的还款账号类型"),
  /*
   * LN127("LN127", "放款、还款或者保证金账号录入错误")
   */
  LN127("LN127", "放款、还款或者保证金账号录入错误"),
  /*
   * LN128("LN128", "受托支付不支持电子账户")
   */
  LN128("LN128", "受托支付不支持电子账户"),
  /*
   * LN999("LN999", "系统内部错误")
   */
  LN129("LN129", "该段时间内部开放，贷款业务！"),
  /*
   * LN999("LN999", "系统内部错误")
   */
  LN130("LN130", "批次号不存在"),

  /*
   * LN999("LN999", "系统内部错误")
   */
  LN131("LN131", "不支持的交易"),
  LN132("LN132", "保证人证件类型错误"),

  LN133("LN133", "币种类型错误"),
  LN134("LN134", "它行代收未成功"),
  /*
   * LN999("LN999", "系统内部错误")
   */
  LN999("LN999", "系统内部错误"),
  /*
   * FM999("FM999", "系统内部错误")
   */
  FM999("FM999", "系统内部错误"),
  /*
   * FM007("FM007", "已有子账户")
   */
  FM007("FM007", "已有子账户"),
   /*
   * FM008("FM008", "合同总金额除以总期数不等于当次放款金额除以当次放款期数")
   */
  FM008("FM008", "传入还款发卡行英文缩写与表配置发卡行英文缩写不一致"),
  /*
   * FM009("FM009", "调用查控系统失败")
   */
  FM009("FM009", "调用查控系统失败"),
  /*
   * FM010("FM010", "该客户在黑名单中，拒绝贷款申请")
   */
  FM010("FM010", "该客户在黑名单中，拒绝贷款申请"),
  /*
   * FM011("FM011", "信息已变更")
   */
  FM011("FM011", "信息已变更"),
  /*
   * FM012("FM012", "鉴权超时，请重新发起")
   */
  FM012("FM012", "鉴权超时，请重新发起"),
  /*
   * FM013("FM013", "需要变更的银行卡和手机号不能和原来的一致")
   */
  FM013("FM013", "需要变更的银行卡和手机号不能和原来的一致"),
  /*
   * FM014("FM014", "查询余额表失败")
   */
  FM014("FM014", "查询余额表失败"),
  /*
   * FM015("FM015", "鉴权失败")
   */
  FM015("FM015", "鉴权失败"),
  /*
   * FM016("FM016", "数据校验失败")
   */
  FM016("FM016", "数据校验失败"),
  
  /*
   * FM017("FM017", "查询账户基本信息失败")
   */
  FM017("FM017", "查询账户基本信息失败"),
  /*
   * FM018("FM018", "查询账户附加信息失败")
   */
  FM018("FM018", "查询账户附加信息失败"),
  /*
   * FM019("FM019", "手机号校验失败")
   */
  FM019("FM019", "手机号校验失败"), 
  /*
   * FM020("FM020", "输入的手机号已注册")
   */
  FM020("FM020", "输入的手机号已注册"),
  /*
   * FM021("FM021", "查询客户映射信息失败")
   */
  FM021("FM021", "查询客户映射信息失败"),
  /*
   * FM022("FM022", "查询客户证件信息失败")
   */
  FM022("FM022", "查询客户证件信息失败"),
  /*
   * FM023("FM023", "更新个人客户信息失败")
   */
  FM023("FM023", "更新个人客户信息失败"),
  /*
   * FM024("FM024", "介质与账户关系表中无此记录或状态不正常!")
   */
  FM024("FM024", "介质与账户关系表中无此记录或状态不正常!"),
  /*
   * FM025("FM025", "本人还款余额不足,请先充值")
   */
  FM025("FM025", "本人还款余额不足,请先充值"),
  /*
   * FM026("FM026", "通信异常")
   */
  FM026("FM026", "通信异常"),
  /*
   * FM027("FM027", "证件号格式不正确")
   */
  FM027("FM027", "证件号格式不正确"),
  /*
   * FM028("FM028", "输入的手机号码不正确")
   */
  FM028("FM028", "输入的手机号码不正确"),
  /*
   * FM029("FM029", "查询账户绑定关系失败")
   */
  FM029("FM029", "查询账户绑定关系失败"),
  /*
   * FM031("FM031", "产品参数查询失败")
   */
  FM031("FM031", "产品参数查询失败"),
  /*
   * FM032("FM032", "获取卡bin参数错误")
   */
  FM032("FM032", "获取卡bin参数错误"),
  /*
   * FM033("FM033", "登记交易流水失败")
   */
  FM033("FM033", "登记交易流水失败"),
  /*
   * FM034("FM034", "查询个人客户信息失败")
   */
  FM034("FM034", "查询个人客户信息失败"),
  /*
   * FM035("FM035", "查询个人客户信息失败")
   */
  FM035("FM035", "查询个人客户信息失败"),
  /*
   * FM036("FM036", "绑定卡银行卡号格式不正确")
   */
  FM036("FM036", "绑定卡银行卡号格式不正确"),
  /*
   * FM037("FM037", "手机号码格式不正确！")
   */
  FM037("FM037", "手机号码格式不正确！"),
  /*
   * FM038("FM038", "传入的卡不是借记卡！")
   */
  FM038("FM038", "手机号码格式不正确！"),
  /*
   * FM039("FM039", "核心开客户号失败")
   */
  FM039("FM039", "核心开客户号失败"),
  /*
   * FM040("FM040", "传入账户不能为0户")
   */
  FM040("FM040", "传入账户不能为0户"),
  /*
   * FM041("FM041", "输入金额不正确")
   */
  FM041("FM041", "输入金额不正确"),
  
  /*
   * FM030("FM030", "核心转账处理中")
   */
  FM030("FM030", "核心转账处理中"),
  
  /*
   * FM042("FM042", "收款金额不能为0")
   */
  FM042("FM042", "收款金额不能为空"),
  
  /*
   * FM043("FM043", "付款款金额不能为0")
   */
  FM043("FM043", "付款款金额不能为空"),
  
  /*
   * FM044("FM044", "子账户序号不能为空")
   */
  FM044("FM044", "子账户序号不能为空"),
  
  /*
   * FM045("FM045", "交易类型不能为空")
   */
  FM045("FM045", "交易类型不能为空"),
  
  /*
   * FM046("FM046", "账户序号不能为空")
   */
  FM046("FM046", "账户序号不能为空"),
  
  /*
   * FM047("FM047", "收款金额与付款金额不相等")
   */
  FM047("FM047", "收款金额与付款金额不相等"),
  
  /*
   * FM048("FM048", "暂不支持此种配置方式")
   */
  FM048("FM048", "暂不支持此种配置方式"),
  
  /*
   * FM049("FM049", "付款方账户余额不足")
   */
  FM049("FM049", "付款方账户余额不足"),
  /*
   * FM051("FM051", "暂不支持此种交易")
   */
  FM051("FM051", "暂不支持此种交易"),
  /*
   * FM052("FM052", "查询鉴权信息失败")
   */
  FM052("FM052", "查询鉴权信息失败"),
  /*
   * FM053("FM053", "对公不修改绑卡手机号")
   */
  FM053("FM053", "对公不修改绑卡手机号"),
  /*
   * FM054("FM054", "该卡已有其他绑定关系")
   */
  FM054("FM054", "该卡已有其他绑定关系"),
  /*
   * FM055("FM055", "未查询到客户号规则控制")
   */
  FM055("FM055", "未查询到客户号规则控制"),
  /*
   * FM056("FM056", "获取cif_no序号异常")
   */
  FM056("FM056", "获取cif_no序号异常"),
  /*
   * FM057("FM057", "获取cif_no序号异常,客户号生成个数超过最大限制")
   */
  FM057("FM057", "获取cif_no序号异常,客户号生成个数超过最大限制"),
  /*
   * FM058("FM058", "获取客户号顺序控制号错误")
   */
  FM058("FM058", "获取客户号顺序控制号错误"),
  /*
   * FM059("FM059", "参数设置错误")
   */
  FM059("FM059", "参数设置错误"),
  /*
   * FM059("FM060", "金额小于0")
   */
  FM060("FM060", "金额小于0"),
  /*
  * BS019("BS019", "调用方法内部异常")
  */
  BS019("BS019", "调用方法内部异常"),

  /*
   * BS018("BS018", "指定的类对象无法被实例化")
   */
  BS018("BS018", "指定的类对象无法被实例化"),

  /*
   * BS017("BS017", "包名不存在")
   */
  BS017("BS017", "包名不存在"),

  /*
   * BS016("BS016", "安全权限异常")
   */
  BS016("BS016", "安全权限异常"),
  
  /*
   * FM050("FM050", "收费数组不能为空")
   */
  FM050("FM050", "收费数组不能为空"),
  /*
   * BM001("BM001", "维度定义表没有此控制编码对应的维度信息")
   */
  BM001("BM001", "维度定义表没有此控制编码对应的维度信息"),
  /*
   * BM002("BM002", "查询维度要素与请求参数关系映射不存在")
   */
  BM002("BM002", "查询维度要素与请求参数关系映射不存在"),
  /*
   * BM003("BM003", "查询维度与自定义函数关系不存在")
   */
  BM003("BM003", "查询维度与自定义函数关系不存在"),
  /*
   * BM004("BM004", "获取COM参数的值为空")
   */
  BM004("BM004", "获取COM参数的值为空"),
  /*
   * BM005("BM005", "获取FUN参数的值为空")
   */
  BM005("BM005", "获取FUN参数的值为空"),
  /*
   * BM006("BM006", "账户限额控制失败")
   */
  BM006("BM006", "账户限额控制失败"),
  /*
   * BM007("BM007", "操作员限额控制失败")
   */
  BM007("BM007", "操作员限额控制失败"),
  /*
   * BM008("BM008", "查询限额项目定义信息不存在")
   */
  BM008("BM008", "查询限额项目定义信息不存在"),
  /*
   * BM009("BM009", "系统限额控制失败")
   */
  BM009("BM009", "系统限额控制失败"),
  /*
   * BM010("BM010", "规则定义表规则定义错误")
   */
  BM010("BM010", "规则定义表规则定义错误"),
  /*
   * BM011("BM011", "规则表达式定义配置错误")
   */
  BM011("BM011", "规则表达式定义配置错误"),
  /*
   * BM012("BM012", "记录没有匹配到表达式")
   */
  BM012("BM012", "记录没有匹配到表达式"),
  /*
   * BM013("BM013", "录入金额超过阀值")
   */
  BM013("BM013", "录入金额超过阀值"),
  /*
   * BM014("BM014", "查询交易服务与要素关联信息不存在")
   */
  BM014("BM014", "查询交易服务与要素关联信息不存在"),
  /*
   * BM015("BM015", "获取控制编码失败")
   */
  BM015("BM015", "获取控制编码失败"),
  /*
   * BM999("BM999", "限额控制失败")
   */
  BM999("BM999", "限额控制失败"),
  
  /*
   * BI101("BI101","核心交易执行失败")
   */
  BI101("BI101","核心交易执行失败"),
  /*
   * BI102("BI102","核心交易已冲正")
   */
  BI102("BI102","核心交易已冲正"),
  
  
  
  
  /**
   * TODO 企业网银添加内部错误码
   * 定义规则:
   * EB     网银
   * xx		错误类型     	  01技术  02业务
   * xx		功能模块     	  00 公共 01 设置 02 付款 03 存款 04 复核 05 账号 06 服务中心 07 登录注册 09外围 10超级网银 11网关支付
   * xx 	错误场景码         开发人员根据业务场景定义         
   */
  EB010000("EB010000","未查询到相关记录信息"),
  EB010001("EB010001","参数错误"),
  EB010002("EB010002","数据新增失败"),
  EB010003("EB010003","方法未找到"),
  EB010004("EB010004","系统异常"),
  EB010005("EB010005","未找到相关类"),
  EB010006("EB010006","获取随机数失败"),
  EB010007("EB010007","反射调用方法失败"),
  EB010008("EB010008","加密机转加密失败"),
  EB010009("EB010009","读取excel文件失败"),
  EB010010("EB010010","导出excel文件失败"),
  EB010011("EB010011","日期转换失败"),
  EB010012("EB010012","定时任务执行失败"),
  
  EB020001("EB020001","未通过黑名单校验"),
  EB020002("EB020002","当前序号值{}大于参数上限值{}"),
  EB020003("EB020003","交易金额大于交易限额"),
  EB020004("EB020004","全部分组下不能添加收款方信息"),
  EB020005("EB020005","查询到的数据不属于此操作员"),
  
  EB020101("EB020101","无需复核业务模式下有且仅有一名操作人员，该操作人员必须为管理员"),
  EB020102("EB020102","单人复核业务模式下至少有两名操作人员，其中至少有一名管理员"),
  EB020103("EB020103","多人复核业务模式下至少有三名操作人员，其中至少有一名管理员"),
  EB020104("EB020104","操作人员已被注销"),
  EB020105("EB020105","联系电话已存在，请重新输入"),
  EB020106("EB020106","此证件已存在未注销的操作人员记录"),
  EB020107("EB020107","操作员证书状态异常"),
  EB020108("EB020108","操作员证书申请失败"),
  EB020109("EB020109","操作员证书已关联操作人员"),
  EB020110("EB020110","操作员证书更换失败"),
  EB020111("EB020111","验签日志更新失败"),
  EB020112("EB020112","操作员证书已过期"),
  EB020113("EB020113","操作员证书状态异常"),
  EB020114("EB020114","该操作员还未注册用户"),
  EB020115("EB020115","该操作员已存在状态正常的用户"),
  EB020117("EB020117","业务复核模式为无需复核模式下时，交易金额不能超过柜面或者网银设置的免复核限额"),
  EB020118("EB020118","交易类型列表不能为空！"),
  EB020119("EB020119","交易编号列表不能为空！"),
  EB020120("EB020120","您当前使用的证书未激活，请进入登录页面用证书登录方式进行证书激活操作"),
  EB020121("EB020121","操作人员功能权限信息不能为空!"),
  EB020122("EB020122","单笔免复核限额和日累计免复核限额必须同时为空或同时不为空"),
  EB020123("EB020123","传入的操作人员账户操作权限信息为空!"),
  
  EB020201("EB020201","转出账户日累计转账金额超出{}"),
  EB020202("EB020202","预约转账日期超出{最大值}天"),
  EB020203("EB020203","年度工资总额超限"),
  EB020204("EB020204","批量代付总金额{}与转账文件汇总金额{}不相等"),
  EB020205("EB020205","批量代付总笔数{}与转账文件汇总笔数{}不相等"),
  EB020206("EB020206","收款方信息中已存在指定账户{}"),
  EB020207("EB020207","不能修改/删除未分组或者全部分组"),
  EB020208("EB020208","转账交易状态不正确"),
  EB020209("EB020209","该批量转账文件中明细超过了3000笔"),
  EB020210("EB020210","未分组下不能添加分组"),
  EB020211("EB020211","收款方账户文件笔数不能超过多少笔"),
  EB020212("EB020212","收款方列表信息为空"),
  EB020213("EB020213","收款方账号或币种错误"),
  EB020214("EB020214","批量代付业务不在营业时间内"),
  EB020215("EB020215","账户账号长度小于6位或大于30位"),
  EB020216("EB020216","已存在收款方信息，不能重复新增"),
  EB020217("EB020217","收款方账户不是本行账户，请检查！"),
  EB020218("EB020218","收款方账户不是专款专用账户，请检查！"),
  
  EB020401("EB020401","流程为空流程，请检查"),
  EB020402("EB020402","当前记录不是待复核或者复核中，不允许复核"),
  EB020403("EB020403","批量代付业务待复核记录为空,请检查!"),
  EB020404("EB020404","复核流程信息不存在!"),
  EB020405("EB020405","该网银下存在管理类待复核记录，不允许进行管理员模式变更"),
  EB020406("EB020406","该管理员下存在待复核记录，不允许进行删除操作"),
  EB020407("EB020407","此交易金额对应的复核子流程信息不存在!"),
  EB020408("EB020408","该交易复核所需第一级别的复核人员不足，请联系管理员查看复核流程设置和操作员权限设置核实修改!"),
  EB020409("EB020409","该交易复核所需第二级别的复核人员不足，请联系管理员查看复核流程设置和操作员权限设置核实修改!"),
  EB020410("EB020410","该交易复核所需第三级别的复核人员不足，请联系管理员查看复核流程设置和操作员权限设置核实修改!"),
  EB020411("EB020411","该交易复核所需第四级别的复核人员不足，请联系管理员查看复核流程设置和操作员权限设置核实修改!"),
  EB020412("EB020412","该交易复核所需第五级别的复核人员不足，请联系管理员查看复核流程设置和操作员权限设置核实修改!"),
  
  
  EB020501("EB020501","网银客户下未查询到正常状态的签约账户"),
  EB020502("EB020502","操作人员无此账户{账号+币种}操作权限"),
  EB020503("EB020503","操作人员无此账户{账号+币种}录入权限"),
  EB020504("EB020504","付款账户无转账权限"),
  EB020505("EB020505","付款账户只能内部转账"),
  EB020506("EB020506","操作人员无此账户{账号+币种}查询权限"),
  EB020507("EB020507","付款账户无查询权限"),
  EB020508("EB020508","付款账户不存在或者不是网银注册账户"),
  EB020509("EB020509","网银签约账户{}未设置交易限额"),
  EB020510("EB020510","单笔免复核限额不能大于柜面设置的操作人员单笔免复核限额"),
  EB020511("EB020511","日累计免复核限额不能大于柜面设置的操作人员日累计免复核限额"),
  EB020512("EB020512","当前交易金额{}大于账户{}单笔交易限额{}"),
  EB020513("EB020513","当前交易金额{}大于账户日累计的剩余额度{}"),
  EB020514("EB020514","当前交易笔数大于账户日累计笔数"),
  EB020515("EB020515","当前交易金额{}大于账户年累计的剩余额度{}"),
  EB020516("EB020516","当前交易金额{}大于操作人员{}的单笔录入限额{}"),
  EB020517("EB020517","当前交易金额{}大于操作人员{}的日累计录入限额{}"),
  EB020518("EB020518","当前交易金额{}大于操作人员{}的单笔复核限额{}"),
  EB020519("EB020519","当前交易金额{}大于操作人员{}的日累计复核限额{}"),
  EB020520("EB020520","当前账户已经添加至当前网银客户"),
  EB020521("EB020521","起始日期和结束日期时间间隔不能超过3个月"),
  EB020522("EB020522","只能查询一年以内的交易流水"),
  EB020523("EB020523","至少设置一组限额信息！"),
  EB020524("EB020524","结束日期不能大于系统日期"),
  EB020525("EB020525","银行对此操作人员没有设置单笔免复核限额，网银不能设置单笔免复核限额!"),
  EB020526("EB020526","银行对此操作人员没有设置日累计免复核限额，网银不能设置日累计免复核限额!"),
  EB020527("EB020527","签约账户的账户操作级别为查询权限，不能做动账类交易!"),
  EB020528("EB020528","当前账户在企业网银中有未支取的定期存款业务"),
  
  EB020701("EB020701","操作人员状态异常"),
  EB020702("EB020702","网银客户号与柜台设置不一致，请重新输入"),
  EB020703("EB020703","网银客户信息状态异常"),
  EB020704("EB020704","已存在该用户信息，请重新输入"),
  EB020705("EB020705","当日密码连续错误次数已达上限，不允许登录"),
  EB020706("EB020706","总密码连续错误次数已达上限，不允许登录"),
  EB020707("EB020707","登录密码错误"),
  EB020708("EB020708","用户已被锁定，不允许登录"),
  EB020709("EB020709","用户已被注销，不允许登录"),
  EB020710("EB020710","用户未开通用户名登陆方式"),
  EB020711("EB020711","同一操作员只能存在一名状态正常或者锁定的用户"),
  EB020712("EB020712","登录密码与确认登录密码不一致，请重新输入"),
  EB020713("EB020713","该账户在账户信息表里不存在"),
  EB020714("EB020714","证书状态为非待激活状态"),
  EB020715("EB020715","证件号码校验失败"),
  EB020716("EB020716","用户名输入格式有误"),
  EB020717("EB020717","网银客户下没有签约账户信息"),
  EB020718("EB020718","用户名不存在"),
  EB020719("EB020719","验证码不能为空，请输入正确验证码"),
  EB020720("EB020720","修改的密码与原密码一致，请重新修改"),
  EB020721("EB020721","请获取短信验证码"),
  EB020722("EB020722","用户名不能为空"),
  EB020723("EB020723","请确认网银客户号与身份证号是否匹配"),
  EB020724("EB020724","密码与用户名一致，请重新修改"),
  EB020725("EB020725","签约账户信息不存在，请检查!"),
  EB020726("EB020726","上传图片不能超过50kb"),
  EB020727("EB020727","上传图片格式不符合要求"),
  EB020728("EB020728","上传头像失败,在服务器写文件失败，请稍后再试"),
  EB020729("EB020729","当前登录人员非管理员，不能进行此操作！"),
  
  EB020801("EB020801","客户信息不存在，请先维护客户信息"),
  EB020802("EB020802","该账户{},币种{}已经添加到网银中"),
  EB020803("EB020803","操作人员,证件l类型{}，证件号码{}已经添加在网银渠道下"),
  EB020804("EB020804","代付账户必须为网银签约账户"),
  EB020805("EB020805","业务类型{业务名称}已经添加了代付业务"),
  EB020806("EB020806","代付业务信息{业务类别}不存在或者已经解约"),
  EB020807("EB020807","网银业务复核模式与操作人员不匹配，校验失败"),
  EB020808("EB020808","当前网银管理员人数已达两位，不允许新增管理员"),
  EB020809("EB020809","无相关操作人员记录"),
  EB020810("EB020810","无需复核模式时，该管理员必须开通金融性交易"),
  EB020811("EB020811","单人复核模式时，该管理员必须设置免复核限额"),
  EB020812("EB020812","单人复核模式时，管理员模式必须为单人模式"),
  EB020813("EB020813","管理员人数最多为2名，最少为1名"),
  EB020814("EB020814","操作员必须开通金融性交易"),
  EB020815("EB020815","单人复核模式时，具有录入权限的操作人员必须设置免复核限额"),
  EB020816("EB020816","单人复核模式时，至少有两名操作人员开通金融性交易功能"),
  EB020817("EB020817","单人复核模式时，管理员开通金融性交易功能时，必须选择操作权限"),
  EB020818("EB020818","单人复核模式时，至少有{}名操作人员"),
  EB020819("EB020819","单人复核模式时，具有录入权限的操作人员不少于一名、具有复核权限的操作人员不少于一名"),
  EB020820("EB020820","管理员模式为双人模式时，管理员人数必须为2名"),
  EB020821("EB020821","此网银已经签约了该业务类别的代付业务"),
  EB020822("EB020822","代付账号必须是一般户"),
  EB020823("EB020823","代付账号对应的客户号和核心账户基本信息的客户号不一致"),
  EB020824("EB020824","开通工资、奖金类型的代付业务的代付账号必须是基本户"),
  EB020825("EB020825","此代付账号已经签约了该业务类别的代付业务"),
  EB020826("EB020826","此代付账号未开通该业务类别的代付业务或已解约"),
  EB020827("EB020827","多人复核模式时，至少有3名操作人员开通金融性交易功能"),
  EB020828("EB020828","管理员必须开通业务签约功能"),
  EB020829("EB020829","单人复核模式时，操作人员必须具有操作权限"),
  EB020830("EB020830","管理员没有金融性交易操作权限时账户查询必须为选中状态"),
  EB020831("EB020831","管理员没有金融性交易操作权限时网银流水查询必须为选中状态"),
  EB020832("EB020832","管理员没有金融性交易操作权限时录入权限必须为未选中状态"),
  EB020833("EB020833","管理员没有金融性交易操作权限时复核权限必须为无复核级别"),
  EB020834("EB020834","交易金额范围起始金额大于或等于结束金额"),
  EB020835("EB020835","复核流程中至少有一个级别上有人数，请检查!"),
  EB020836("EB020836","您复核的记录可能已经由别人复核，请刷新后重试"),
  EB020837("EB020837","单人业务模式下，复核流程只能是一级一人，流程有误"),


  
  //存款类错误码
  EB020301("EB020301","存款账户信息不存在，账号{}，币种{}"),
  EB020302("EB020302","交易金额大于当前账户可用余额"),
  EB020303("EB020303","存款记录信息为空"),
  EB020304("EB020304","定期存款只允许部分支取一次，再次支取，需支取全部金额"),
  EB020305("EB020305","该存款不允许线上支取"),
  EB020306("EB020306","支取日期必须大于系统日期"),
  EB020307("EB020307","存款产品信息记录不存在"),
  EB020308("EB020308","支取日期与开户日期相差不能少于{}天"),
  EB020309("EB020309","存入金额{}不能小于产品起存金额{}"),
  EB020310("EB020310","验签签名信息发生了错误!"),
  EB020311("EB020311","通知编号不能为空！"),
  EB020312("EB020312","支取金额{}不能小于最小支取金额{}"),
  EB020314("EB020314","支取后留存金额不足，可以全部支取或预留不小于{}!"),
  EB020315("EB020315","通知日期必须小于等于系统日期!"),
  EB020316("EB020316","cfca硬验签失败"),
  EB020317("EB020317","通知日期必须大于等于系统日期"),
  EB020318("EB020318","利率编号已被使用！"),
  EB020319("EB020319","利率审批信息查询为空！"),
  EB020320("EB020320","利率编号不存在！"),
  //外围调用异常
  EB020901("EB020901","调用核心行内账户校验异常"),
  EB020902("EB020902","跨行手续费试算异常"),
  EB020903("EB020903","根据核心客户号查询核心客户信息异常"),
  EB020904("EB020904","跨行转账调用统一支付平台2008接口异常"),
  EB020905("EB020905","凭证维护异常"),
  EB020906("EB020906","查询核心客户信息异常"),
  EB020907("EB020907","根据渠道流水号查询流水状态异常"),
  EB020908("EB020908"," 冲正"),
  EB020909("EB020909","电子渠道交易查证"),
  EB020910("EB020910","定期支取"),
  EB020911("EB020911","存款支取预约登记"),
  EB020912("EB020912","定期开户"),
  EB020913("EB020913","账户交易历史查询"),
  EB020914("EB020914","利率查询"),
  EB020915("EB020915","利息查询"),
  EB020916("EB020916","存款支取预约登记薄查询"),
  EB020917("EB020917","账户（详细）结算信息查询"),
  EB020918("EB020918","跨行业务退汇信息查询"),
  EB020919("EB020918","手工收费"),
  EB020920("EB020920","验签失败"),
  //超级网银
  EB021001("EB021001","授权本行查询签约/解约失败"),
  EB021002("EB021002","授权他行查询签约/解约失败"),
  EB021003("EB021003","授权本行支付签约/解约路径支付失败"),
  EB021004("EB021004","企业网银同他行签约信息查询失败"),
  EB021005("EB021005","查询协议URL跳转应答交易失败"),
  EB021006("EB021006","支付协议URL跳转应答交易失败"),
  EB021007("EB021007","被查询人账号与被查询人户名不符"),
  EB021008("EB021008","被查询人账号账户状态非活动状态"),
  EB021009("EB021009","被查询机构名称不符"),
  EB021010("EB021010","付款人账号与付款人户名不符"),
  EB021011("EB021011","已签约查询协议的他行账号查询失败"),
  EB021012("EB021012","已签约支付协议的他行账号查询失败"),
  EB021013("EB021013","已签约查询协议的本行账号查询失败"),
  EB021014("EB021014","已签约支付协议的本行账号查询失败"),
  EB021015("EB021015","授权本行查询和支付签约/解约短信认证失败"),
  EB021016("EB021016","该操作员非管理员，此交易必须管理员权限才能执行！"),
  //网关支付
  EB021101("EB021101","订单状态不是待记账状态"),
  EB021102("EB021102","该订单已经处于付款处理中状态，不能重复提交"),
  EB021103("EB021103","该订单处于处于完成状态，不能重复提交"),
  EB021104("EB021104","该订单处于处理中状态，不能重复提交"),
  //电票系统
  EB021201("EB021201","该客户信息已签约,不能重复签约 "),
  EB021202("EB021202","该账户未在网银端签约，请签约后操作！"),
  EB021203("EB021203","该账户未在网银端签约，请签约后操作！"),
  EB021204("EB021204","调用电票系统追索通知待处理列表查询记录为空！"),
  EB021205("EB021205","调用电票系统同意清偿应答待处理列表查询记录为空！"),
  EB021206("EB021206","调用电票系统同意清偿待处理列表查询记录为空！"),
  EB021207("EB021207","调用电票系统提示保证待处理列表查询记录为空！"),
  EB021208("EB021208","查询企业网银无可用电票签约账户!"),
  EB021209("EB021209","调用电票系统提示付款申请待处理列表查询记录为空！"),
  EB021210("EB021210","调用电票系统付款回复处理列表查询记录为空！"),
  EB021211("EB021211","调用电票系统保证回复待处理列表查询记录为空！"),
  EB021212("EB021212","网银电票出票承兑详情查询记录为空！"),
  EB021213("EB021213","电子票据背书转让详情查询记录为空！"),
  EB021214("EB021214","电子票据保证交易详情查询记录为空！"),
  EB021215("EB021215","电子票据贴现交易详情查询记录为空！"),
  EB021216("EB021216","电子票据质押交易详情查询记录为空！"),
  EB021217("EB021217","电子票据付款交易详情查询记录为空！"),
  EB021218("EB021218","电子票据追索交易详情查询记录为空！"),
  EB021219("EB021219","调用电票系统贴现待处理列表查询记录为空！"),
  EB021220("EB021220","调用电票系统背书转让待处理列表查询记录为空！"),
  EB021221("EB021221","保证回复标记格式错误！"),
  EB021222("EB021222","到期日与出票日相差不能大于超过一年"),
  EB021223("EB021223","到期日期必须大于出票日期"),
  EB021224("EB021224","出票日期必须小于等于系统日期"),
  EB021225("EB021225","到期日期必须大于系统日期"),
  EB021226("EB021226","交易列表信息为空"),
  EB021227("EB021227","电票质押申请人不能和质权人是同一个账号"),
  EB021228("EB021228","贴现利率传入有误，必须在0~100之间(包含0和100)"),
  EB021229("EB021229","查询电票交易登记簿信息为空"),
  EB021230("EB021230","承兑人账号不能和出票人账号为同一账号"),
  EB021231("EB021231","收款人账号不能和出票人账号为同一账号"),
  EB021232("EB021232","承兑人账号不能和收款人账号为同一账号"),
  EB021233("EB021233","被背书人账号不能和背书人账号为同一账号"),
  EB021234("EB021234","贴入人账号不能和贴出人账号为同一账号"),
  EB021235("EB021235","质权人账号不能和出质人账号是同一个账号"),
  EB021236("EB021236","保证人账号不能和被保证人账号为同一账号"),
  EB021237("EB021237","该企业网银无签约电票业务，不允许添加电票菜单给操作员"),
  EB021238("EB021238","出票人账户和收款人账户不能为同一企业！"),
  EB021239("EB021239","签约账号存在待复核或复核中的交易，不能进行解约操作！"),
  //电子回单系统
  EB021301("EB021301","邮箱路径最多不可超过三条"),
  EB021302("EB021302","电子回单明细条数不可超过二十条"),
  EB021303("EB021303","互金流水号,放款账号,核心流水主键条数不对应"),
  EB021304("EB021304","传入的回单类型错误"),
  EB021305("EB021305","核心交易流水号,还款人账号,核心流水主键条数不对应"),
  EB021306("EB021306","互金流水号与核心流水主键条数不对应"),
  
  //智能投顾
  EB021401("EB021401","您的账户资金投顾还未签约，不能进行解约操作"),
  EB021402("EB021402","您的账户资金投顾已签约，不能重复签约"),
  //银企对账
  EB021501("EB021501","操作人员无余额对账单核对录入权限"),
  //贷款-提前还款
  EB021701("EB021701","提前还款功能服务暂时停止！"),
  EB021702("EB021702","当前借据存在逾期记录，不支持提前还款!"),
  EB021610("EB021610","第三方发起流水不是正整数"),
  ;
  private String code;
  private String desc;

  ErrCode(String code, String desc) {
    this.code = code;
    this.desc = desc;
  }

  public String code() {
    return code;
  }

  public String desc() {
    return desc;
  }
}
